eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/**
  ******************************************************************************
  * @file    MDR1986VE3.h
  * @author  Sidorov Andrey
  * @version V1.4.0
  * @date    22/02/2013
  * @brief   This file contains all the Special Function Registers definitions
  *          for the Milandr 1986VE3 microcontroller.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 Milandr </center></h2>
  ******************************************************************************
  * FILE MDR1986VE3.h
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR1986VE3_H
#define __MDR1986VE3_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @defgroup MDR1986VE3 MDR1986VE3
 *  @{
 */

/** @defgroup __MDR1986VE3_Peripheral MDR1986VE3 Peripheral
  * @{
  */

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/**
  * @brief MDR1986VE3 Interrupt Number Definition
  */

typedef enum IRQn
{
/*-----  Cortex-M1 Processor Exceptions Numbers --------------------------------------------------*/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             *///!< NonMaskableInt_IRQn
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M1 Hard Fault Interrupt                     *///!< HardFault_IRQn
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M1 SV Call Interrupt                       *///!< SVCall_IRQn
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M1 Pend SV Interrupt                       *///!< PendSV_IRQn
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M1 System Tick Interrupt                   *///!< SysTick_IRQn

/*----- 1986EV3 specific Interrupt Numbers -------------------------------------------------------*/
  MIL_STD_1553B2_IRQn         = 0,      /*!< MIL_STD_1553B2 Interrupt                             *///!< MIL_STD_1553B2_IRQn
  MIL_STD_1553B1_IRQn         = 1,      /*!< MIL_STD_1553B1 Interrupt                             *///!< MIL_STD_1553B1_IRQn
  USB_IRQn                    = 2,      /*!< USB Host Interrupt                                   *///!< USB_IRQn
  CAN1_IRQn                   = 3,      /*!< CAN1 Interrupt                                       *///!< CAN1_IRQn
  CAN2_IRQn                   = 4,      /*!< CAN2 Interrupt                                       *///!< CAN2_IRQn
  DMA_IRQn                    = 5,      /*!< DMA Interrupt                                        *///!< DMA_IRQn
  UART1_IRQn                  = 6,      /*!< UART1 Interrupt                                      *///!< UART1_IRQn
  UART2_IRQn                  = 7,      /*!< UART2 Interrupt                                      *///!< UART2_IRQn
  SSP1_IRQn                   = 8,      /*!< SSP1 Interrupt                                       *///!< SSP1_IRQn
  BUSY_IRQn                   = 9,      /*!< BUSY Interrupt                                       *///!< BUSY_IRQn
  ARINC429R_IRQn              = 10,     /*!< ARINC429 Receiver Interrupt                          *///!< ARINC429R_IRQn
  POWER_IRQn                  = 11,     /*!< POWER Detecor Interrupt                              *///!< POWER_IRQn
  WWDG_IRQn                   = 12,     /*!< Window Watchdog Interrupt                            *///!< WWDG_IRQn
  TIMER4_IRQn                 = 13,     /*!< Timer4 Interrupt                                     *///!< TIMER4_IRQn
  TIMER1_IRQn                 = 14,     /*!< Timer1 Interrupt                                     *///!< TIMER1_IRQn
  TIMER2_IRQn                 = 15,     /*!< Timer2 Interrupt                                     *///!< TIMER2_IRQn
  TIMER3_IRQn                 = 16,     /*!< Timer3 Interrupt                                     *///!< TIMER3_IRQn
  ADC_IRQn                    = 17,     /*!< ADC Interrupt                                        *///!< ADC_IRQn
  ETHERNET_IRQn               = 18,     /*!< Ethernet Interrupt                                   *///!< ETHERNET_IRQn
  SSP3_IRQn                   = 19,     /*!< SSP3 Interrupt                                       *///!< SSP3_IRQn
  SSP2_IRQn                   = 20,     /*!< SSP2 Interrupt                                       *///!< SSP2_IRQn
  ARINC429T_IRQn              = 21,     /*!< ARINC429 Transmitter 1 Interrupt                     *///!< ARINC429T1_IRQn
  KEYPAD_IRQn                 = 22,     /*!< ARINC429 Transmitter 2 Interrupt                     *///!< ARINC429T2_IRQn
  LED_IRQn                    = 23,     /*!< ARINC429 Transmitter 3 Interrupt                     *///!< ARINC429T3_IRQn
  UART3_UART4_IRQn            = 24,     /*!< ARINC429 Transmitter 4 Interrupt                     *///!< ARINC429T4_IRQn
  AUDIO_IP_IRQn               = 25,     /*!< ARINC429 Transmitter 4 Interrupt                     *///!< ARINC429T4_IRQn
  ETHERNET2_IRQn              = 26,     /*!< Ethernet Interrupt                                   *///!< ETHERNET_IRQn
  BKP_IRQn                    = 27,     /*!< BACKUP Interrupt                                     *///!< BKP_IRQn
  EXT_INT1_IRQn               = 28,     /*!< EXT_INT1 Interrupt                                   *///!< EXT_INT1_IRQn
  EXT_INT2_IRQn               = 29,     /*!< EXT_INT2 Interrupt                                   *///!< EXT_INT2_IRQn
  EXT_INT3_IRQn               = 30,     /*!< EXT_INT3 Interrupt                                   *///!< EXT_INT3_IRQn
  EXT_INT4_IRQn               = 31      /*!< EXT_INT4 Interrupt                                   *///!< EXT_INT4_IRQn
}IRQn_Type;

/** @addtogroup __VE3___Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */

/* Configuration of the Cortex-M1 Processor and Core Peripherals */
#define __CM1_REV              0x0102   /*!< Cortex-M1 Core Revision                      */
#define __MPU_PRESENT             0     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          2     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* __Configuration_of_CMSIS */

/* Includes ------------------------------------------------------------------*/
#include "MDR32F9Qx_config.h"
#include "core_cm1.h"
#include "system_MDR1986VE3.h"

/** @defgroup __VE3___Exported_types Exported types
  * @{
  */
typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)   (((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __Exported_types */

/** @defgroup __VE3___MDR1986VE3__Periph_CAN CAN
  * @{
  */

/** @defgroup __VE3___MDR1986VE3_CAN_Data_Structures Data Structures
  * @{
  */

/* MDR_CAN_BUF_TypeDef structure */
typedef struct
{
  __IO uint32_t ID;
  __IO uint32_t DLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
}MDR_CAN_BUF_TypeDef;

/* MDR_CAN_BUF_FILTER_TypeDef structure */
typedef struct
{
  __IO uint32_t MASK;
  __IO uint32_t FILTER;
}MDR_CAN_BUF_FILTER_TypeDef;

/* MDR_CAN_TypeDef structure */
typedef struct
{
  __IO uint32_t CONTROL;
  __IO uint32_t STATUS;
  __IO uint32_t BITTMNG;
       uint32_t RESERVED0;
  __IO uint32_t INT_EN;
       uint32_t RESERVED1[2];
  __IO uint32_t OVER;
  __IO uint32_t RXID;
  __IO uint32_t RXDLC;
  __IO uint32_t RXDATAL;
  __IO uint32_t RXDATAH;
  __IO uint32_t TXID;
  __IO uint32_t TXDLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
  __IO uint32_t BUF_CON[32];
  __IO uint32_t INT_RX;
  __IO uint32_t RX;
  __IO uint32_t INT_TX;
  __IO uint32_t TX;
       uint32_t RESERVED2[76];
    MDR_CAN_BUF_TypeDef CAN_BUF[32];
       uint32_t RESERVED3[64];
    MDR_CAN_BUF_FILTER_TypeDef CAN_BUF_FILTER[32];
}MDR_CAN_TypeDef;

