eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group MDR1986VE3_CAN_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_CAN_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_CAN_CONTROL  CAN CONTROL
  * @{
  */

/*-- CAN_CONTROL: CAN Control Register -----------------------------*/
/* Bit field positions: */
#define CAN_CONTROL_CAN_EN_Pos                  0
#define CAN_CONTROL_ROM_Pos                     1
#define CAN_CONTROL_STM_Pos                     2
#define CAN_CONTROL_SAP_Pos                     3
#define CAN_CONTROL_ROP_Pos                     4

/* Bit field masks: */
#define CAN_CONTROL_CAN_EN                      ((uint32_t)0x00000001)
#define CAN_CONTROL_ROM                         ((uint32_t)0x00000002)
#define CAN_CONTROL_STM                         ((uint32_t)0x00000004)
#define CAN_CONTROL_SAP                         ((uint32_t)0x00000008)
#define CAN_CONTROL_ROP                         ((uint32_t)0x00000010)

/** @} */ /* End of group CAN_CONTROL */

/** @defgroup __VE3_Periph_CAN_STATUS   CAN STATUS
  * @{
  */

/*-- CAN_STATUS: CAN Status Register -------------------------------*/
/* Bit field positions: */
#define CAN_STATUS_RX_READY_Pos                 0
#define CAN_STATUS_TX_READY_Pos                 1
#define CAN_STATUS_ERROR_OVER_Pos               2
#define CAN_STATUS_BIT_ERR_Pos                  3
#define CAN_STATUS_BIT_STUFF_ERR_Pos            4
#define CAN_STATUS_CRC_ERR_Pos                  5
#define CAN_STATUS_FRAME_ERR_Pos                6
#define CAN_STATUS_ACK_ERR_Pos                  7
#define CAN_STATUS_IDLOWER_Pos                  8
#define CAN_STATUS_ERR_STATUS_Pos               9
#define CAN_STATUS_RX_ERR_CNT8_Pos              11
#define CAN_STATUS_TX_ERR_CNT8_Pos              12
#define CAN_STATUS_RX_ERR_CNT_Pos               16
#define CAN_STATUS_TX_ERR_CNT_Pos               24

/* Bit field masks: */
#define CAN_STATUS_RX_READY                     ((uint32_t)0x00000001)
#define CAN_STATUS_TX_READY                     ((uint32_t)0x00000002)
#define CAN_STATUS_ERROR_OVER                   ((uint32_t)0x00000004)
#define CAN_STATUS_BIT_ERR                      ((uint32_t)0x00000008)
#define CAN_STATUS_BIT_STUFF_ERR                ((uint32_t)0x00000010)
#define CAN_STATUS_CRC_ERR                      ((uint32_t)0x00000020)
#define CAN_STATUS_FRAME_ERR                    ((uint32_t)0x00000040)
#define CAN_STATUS_ACK_ERR                      ((uint32_t)0x00000080)
#define CAN_STATUS_IDLOWER                      ((uint32_t)0x00000100)
#define CAN_STATUS_ERR_STATUS_Msk               ((uint32_t)0x00000600)
#define CAN_STATUS_RX_ERR_CNT8                  ((uint32_t)0x00000800)
#define CAN_STATUS_TX_ERR_CNT8                  ((uint32_t)0x00001000)
#define CAN_STATUS_RX_ERR_CNT_Msk               ((uint32_t)0x00FF0000)
#define CAN_STATUS_TX_ERR_CNT_Msk               ((uint32_t)0xFF000000)

/* ERR STATUS Modes */
#define CAN_STATUS_ERR_STATUS_ERROR_ACTIVE      0x00
#define CAN_STATUS_ERR_STATUS_ERROR_PASSIVE     0x01
#define CAN_STATUS_ERR_STATUS_ERROR_BUS_OFF_Pos 10

/** @} */ /* End of group CAN_STATUS */

/** @defgroup __VE3_Periph_CAN_BITTMNG  CAN BITTMNG
  * @{
  */

/*-- CAN_BITTMNG: CAN Bittiming Register ---------------------------*/
/* Bit field positions: */
#define CAN_BITTMNG_BRP_Pos                     0
#define CAN_BITTMNG_PSEG_Pos                    16
#define CAN_BITTMNG_SEG1_Pos                    19
#define CAN_BITTMNG_SEG2_Pos                    22
#define CAN_BITTMNG_SJW_Pos                     25
#define CAN_BITTMNG_SB_Pos                      27

/* Bit field masks: */
#define CAN_BITTMNG_BRP_Msk                     ((uint32_t)0x0000FFFF)
#define CAN_BITTMNG_PSEG_Msk                    ((uint32_t)0x00070000)
#define CAN_BITTMNG_SEG1_Msk                    ((uint32_t)0x00380000)
#define CAN_BITTMNG_SEG2_Msk                    ((uint32_t)0x01C00000)
#define CAN_BITTMNG_SJW_Msk                     ((uint32_t)0x06000000)
#define CAN_BITTMNG_SB                          ((uint32_t)0x08000000)

/* PSEG Modes */
#define CAN_BITTMNG_PSEG_1_TQ                   0x00
#define CAN_BITTMNG_PSEG_2_TQ                   0x01
#define CAN_BITTMNG_PSEG_3_TQ                   0x02
#define CAN_BITTMNG_PSEG_4_TQ                   0x03
#define CAN_BITTMNG_PSEG_5_TQ                   0x04
#define CAN_BITTMNG_PSEG_6_TQ                   0x05
#define CAN_BITTMNG_PSEG_7_TQ                   0x06
#define CAN_BITTMNG_PSEG_8_TQ                   0x07

/* SEG1 Modes */
#define CAN_BITTMNG_SEG1_1_TQ                   0x00
#define CAN_BITTMNG_SEG1_2_TQ                   0x01
#define CAN_BITTMNG_SEG1_3_TQ                   0x02
#define CAN_BITTMNG_SEG1_4_TQ                   0x03
#define CAN_BITTMNG_SEG1_5_TQ                   0x04
#define CAN_BITTMNG_SEG1_6_TQ                   0x05
#define CAN_BITTMNG_SEG1_7_TQ                   0x06
#define CAN_BITTMNG_SEG1_8_TQ                   0x07

/* SEG2 Modes */
#define CAN_BITTMNG_SEG2_1_TQ                   0x00
#define CAN_BITTMNG_SEG2_2_TQ                   0x01
#define CAN_BITTMNG_SEG2_3_TQ                   0x02
#define CAN_BITTMNG_SEG2_4_TQ                   0x03
#define CAN_BITTMNG_SEG2_5_TQ                   0x04
#define CAN_BITTMNG_SEG2_6_TQ                   0x05
#define CAN_BITTMNG_SEG2_7_TQ                   0x06
#define CAN_BITTMNG_SEG2_8_TQ                   0x07

/* SJW Modes */
#define CAN_BITTMNG_SJW_1_TQ                    0x00
#define CAN_BITTMNG_SJW_2_TQ                    0x01
#define CAN_BITTMNG_SJW_3_TQ                    0x02
#define CAN_BITTMNG_SJW_4_TQ                    0x03

/** @} */ /* End of group CAN_BITTMNG */

/** @defgroup __VE3_Periph_CAN_INT_EN   CAN INT EN
  * @{
  */

/*-- CAN_INT_EN: CAN Interrupt enable Register ---------------------*/
/* Bit field positions: */
#define CAN_INT_EN_GLB_INT_EN_Pos               0
#define CAN_INT_EN_RX_INT_EN_Pos                1
#define CAN_INT_EN_TX_INT_EN_Pos                2
#define CAN_INT_EN_ERR_INT_EN_Pos               3
#define CAN_INT_EN_ERR_OVER_INT_EN_Pos          4

/* Bit field masks: */
#define CAN_INT_EN_GLB_INT_EN                   ((uint32_t)0x00000001)
#define CAN_INT_EN_RX_INT_EN                    ((uint32_t)0x00000002)
#define CAN_INT_EN_TX_INT_EN                    ((uint32_t)0x00000004)
#define CAN_INT_EN_ERR_INT_EN                   ((uint32_t)0x00000008)
#define CAN_INT_EN_ERR_OVER_INT_EN              ((uint32_t)0x00000010)

/** @} */ /* End of group CAN_INT_EN */

/** @defgroup __VE3_Periph_CAN_RXID CAN RXID
  * @{
  */

/*-- CAN_RXID:   CAN Receive ID Register ---------------------------*/
/*-- CAN_TXID:   CAN Transmit ID Register --------------------------*/
/*-- CAN_BUF_ID: CAN Buffer ID Register ----------------------------*/
/* Bit field positions: */
#define CAN_ID_EID_Pos                          0
#define CAN_ID_SID_Pos                          18

/* Bit field masks: */
#define CAN_ID_EID_Msk                          ((uint32_t)0x0003FFFF)
#define CAN_ID_SID_Msk                          ((uint32_t)0x1FFC0000)

/** @} */ /* End of group CAN_RXID */

/** @defgroup __VE3_Periph_CAN_RXDLC    CAN RXDLC
  * @{
  */

/*-- CAN_RXDLC:   CAN Receive DLC Register -------------------------*/
/*-- CAN_TXDLC:   CAN Transmit DLC Register ------------------------*/
/*-- CAN_BUF_DLC: CAN Buffer DLC Register --------------------------*/
/* Bit field positions: */
#define CAN_DLC_Pos                             0
#define CAN_DLC_RTR_Pos                         8
#define CAN_DLC_R1_Pos                          9
#define CAN_DLC_R0_Pos                          10
#define CAN_DLC_SSR_Pos                         11
#define CAN_DLC_IDE_Pos                         12

/* Bit field masks: */
#define CAN_DLC_Msk                             ((uint32_t)0x0000000F)
#define CAN_DLC_RTR                             ((uint32_t)0x00000100)
#define CAN_DLC_R1                              ((uint32_t)0x00000200)
#define CAN_DLC_R0                              ((uint32_t)0x00000400)
#define CAN_DLC_SSR                             ((uint32_t)0x00000800)
#define CAN_DLC_IDE                             ((uint32_t)0x00001000)

/* DLC Modes */
#define CAN_DLC_NO_DATA                         0x00
#define CAN_DLC_1_BYTE                          0x01
#define CAN_DLC_2_BYTES                         0x02
#define CAN_DLC_3_BYTES                         0x03
#define CAN_DLC_4_BYTES                         0x04
#define CAN_DLC_5_BYTES                         0x05
#define CAN_DLC_6_BYTES                         0x06
#define CAN_DLC_7_BYTES                         0x07
#define CAN_DLC_8_BYTES                         0x08

/** @} */ /* End of group CAN_RXDLC */

/** @defgroup __VE3_Periph_CAN_RXDATAL  CAN RXDATAL
  * @{
  */

