eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group Periph_RST_CLK_Data_Structures */

/** @defgroup __VE3_Periph_RST_CLK_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_RST_CLK_CLOCK_STATUS RST CLK CLOCK STATUS
  * @{
  */

/*-- RST_CLK_CLOCK_STATUS: Clock Status Register -------------------*/
/* Bit field positions: */
#define RST_CLK_CLOCK_STATUS_PLL_USB_RDY_Pos    0
#define RST_CLK_CLOCK_STATUS_PLL_CPU_RDY_Pos    1
#define RST_CLK_CLOCK_STATUS_HSE_RDY_Pos        2
#define RST_CLK_CLOCK_STATUS_HSE_RDY2_Pos       3

/* Bit field masks: */
#define RST_CLK_CLOCK_STATUS_PLL_USB_RDY        ((uint32_t)0x00000001)
#define RST_CLK_CLOCK_STATUS_PLL_CPU_RDY        ((uint32_t)0x00000002)
#define RST_CLK_CLOCK_STATUS_HSE_RDY            ((uint32_t)0x00000004)
#define RST_CLK_CLOCK_STATUS_HSE_RDY2           ((uint32_t)0x00000008)

#define RST_CLK_CLOCK_STATUS_HSE_ALL_RDY        (RST_CLK_CLOCK_STATUS_HSE_RDY | \
                                                 RST_CLK_CLOCK_STATUS_HSE_RDY2)

/** @} */ /* End of group RST_CLK_CLOCK_STATUS */


/** @defgroup __VE3_Periph_RST_CLK_PLL_CONTROL  RST CLK PLL CONTROL
  * @{
  */

/*-- RST_CLK_PLL_CONTROL: PLL Control Register ---------------------*/
/* Bit field positions: */
#define RST_CLK_PLL_CONTROL_PLL_USB_ON_Pos      0
#define RST_CLK_PLL_CONTROL_PLL_USB_RLD_Pos     1
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON_Pos      2
#define RST_CLK_PLL_CONTROL_PLL_CPU_PLD_Pos     3
#define RST_CLK_PLL_CONTROL_PLL_USB_MUL_Pos     4
#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos     8

/* Bit field masks: */
#define RST_CLK_PLL_CONTROL_PLL_USB_ON          ((uint32_t)0x00000001)
#define RST_CLK_PLL_CONTROL_PLL_USB_RLD         ((uint32_t)0x00000002)
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON          ((uint32_t)0x00000004)
#define RST_CLK_PLL_CONTROL_PLL_CPU_PLD         ((uint32_t)0x00000008)
#define RST_CLK_PLL_CONTROL_PLL_USB_MUL_Msk     ((uint32_t)0x000000F0)
#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk     ((uint32_t)0x00000F00)

/** @} */ /* End of group RST_CLK_PLL_CONTROL */


/** @defgroup __VE3_Periph_RST_CLK_HS_CONTROL   RST CLK HS CONTROL
  * @{
  */

/*-- RST_CLK_HS_CONTROL: HS Control Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_HS_CONTROL_HSE_ON_Pos           0
#define RST_CLK_HS_CONTROL_HSE_BYP_Pos          1
#define RST_CLK_HS_CONTROL_HSE_ON2_Pos          2
#define RST_CLK_HS_CONTROL_HSE_BYP2_Pos         3

/* Bit field masks: */
#define RST_CLK_HS_CONTROL_HSE_ON               ((uint32_t)0x00000001)
#define RST_CLK_HS_CONTROL_HSE_BYP              ((uint32_t)0x00000002)
#define RST_CLK_HS_CONTROL_HSE_ON2              ((uint32_t)0x00000004)
#define RST_CLK_HS_CONTROL_HSE_BYP2             ((uint32_t)0x00000008)

/** @} */ /* End of group RST_CLK_HS_CONTROL */


/** @defgroup __VE3_Periph_RST_CLK_CPU_CLOCK    RST CLK CPU CLOCK
  * @{
  */

/*-- RST_CLK_CPU_CLOCK: CPU Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos        0
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos        2
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos        4
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Pos          8

/* Bit field masks: */
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk        ((uint32_t)0x00000003)
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL            ((uint32_t)0x00000004)
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk        ((uint32_t)0x000000F0)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Msk          ((uint32_t)0x00000300)

/* CPU C1 SEL Modes */
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI              0x00
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI_DIV_2        0x01
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE              0x02
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE_DIV_2        0x03

/* CPU C2 SEL Modes */
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_CPU_C1           0x00
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_PLL_CPU          0x01

/* CPU C3 SEL Modes */
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2           0x00
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_2     0x08
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_4     0x09
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_8     0x0A
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_16    0x0B
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_32    0x0C
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_64    0x0D
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_128   0x0E
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_CPU_C2_DIV_256   0x0F

/* HCLK SEL Modes */
#define RST_CLK_CPU_CLOCK_HCLK_SEL_HSI                0x00
#define RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3             0x01
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSE                0x02
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSI                0x03

/** @} */ /* End of group Periph_RST_CLK_CPU_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_USB_CLOCK    RST CLK USB CLOCK
  * @{
  */

/*-- RST_CLK_USB_CLOCK: USB Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_USB_CLOCK_USB_C1_SEL_Pos        0
#define RST_CLK_USB_CLOCK_USB_C2_SEL_Pos        2
#define RST_CLK_USB_CLOCK_USB_C3_SEL_Pos        4
#define RST_CLK_USB_CLOCK_USB_CLK_EN_Pos        8

/* Bit field masks: */
#define RST_CLK_USB_CLOCK_USB_C1_SEL_Msk        ((uint32_t)0x00000003)
#define RST_CLK_USB_CLOCK_USB_C2_SEL            ((uint32_t)0x00000004)
#define RST_CLK_USB_CLOCK_USB_C3_SEL            ((uint32_t)0x00000010)
#define RST_CLK_USB_CLOCK_USB_CLK_EN            ((uint32_t)0x00000100)

/* USB C1 SEL Modes */
#define RST_CLK_USB_CLOCK_USB_C1_SEL_HSI            0x00
#define RST_CLK_USB_CLOCK_USB_C1_SEL_HSI_DIV_2      0x01
#define RST_CLK_USB_CLOCK_USB_C1_SEL_HSE            0x02
#define RST_CLK_USB_CLOCK_USB_C1_SEL_HSE_DIV_2      0x03

/* USB C2 SEL Modes */
#define RST_CLK_USB_CLOCK_USB_C2_SEL_USB_C1         0x00
#define RST_CLK_USB_CLOCK_USB_C2_SEL_PLL_USB        0x01

/* USB C3 SEL Modes */
#define RST_CLK_USB_CLOCK_USB_C3_SEL_USB_C2         0x00
#define RST_CLK_USB_CLOCK_USB_C3_SEL_USB_C2_DIV_2   0x01

/** @} */ /* End of group RST_CLK_USB_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_ADC_MCO_CLOCK    RST CLK ADC MCO CLOCK
  * @{
  */

/*-- RST_CLK_ADC_MCO_CLOCK: ADC Clock Register ---------------------*/
/* Bit field positions: */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_Pos    0
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_Pos    4
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_Pos    8
#define RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN_Pos    13
#define RST_CLK_ADC_MCO_CLOCK_AUC_C1_SEL_Pos    16
#define RST_CLK_ADC_MCO_CLOCK_AUC_C2_SEL_Pos    20
#define RST_CLK_ADC_MCO_CLOCK_AUC_C3_SEL_Pos    24
#define RST_CLK_ADC_MCO_CLOCK_AUC_CLK_EN_Pos    31

/* Bit field masks: */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_Msk    ((uint32_t)0x00000003)
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_Msk    ((uint32_t)0x00000030)
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_Msk    ((uint32_t)0x00000F00)
#define RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN        ((uint32_t)0x00002000)

/* ADC C1 SEL Modes */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_CPU_C1           0x00
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_USB_C1           0x01
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_CPU_C2           0x02
#define RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_USB_C2           0x03

/* ADC C2 SEL Modes */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_LSE              0x00
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_LSI              0x01
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_ADC_C1           0x02
#define RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_HSI_C1           0x03

