eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/* ADC C3 SEL Modes */
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2           0x00
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_2     0x08
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_4     0x09
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_8     0x0A
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_16    0x0B
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_32    0x0C
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_64    0x0D
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_128   0x0E
#define RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_ADC_C2_DIV_256   0x0F

#define RST_CLK_ADC_MCO_CLOCK_AUC_C1_SEL_Msk    ((uint32_t)0x00030000)
#define RST_CLK_ADC_MCO_CLOCK_AUC_C2_SEL_Msk    ((uint32_t)0x00300000)
#define RST_CLK_ADC_MCO_CLOCK_AUC_C3_SEL_Msk    ((uint32_t)0x0F000000)
#define RST_CLK_ADC_MCO_CLOCK_AUC_CLK_EN        ((uint32_t)0x80000000)

/** @} */ /* End of group RST_CLK_ADC_MCO_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_RTC_CLOCK    RST CLK RTC CLOCK
  * @{
  */

/*-- RST_CLK_RTC_CLOCK: RTC Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_RTC_CLOCK_HSE_SEL_Pos           0
#define RST_CLK_RTC_CLOCK_HSI_SEL_Pos           4
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN_Pos        8
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN_Pos        9

/* Bit field masks: */
#define RST_CLK_RTC_CLOCK_HSE_SEL_Msk           ((uint32_t)0x0000000F)
#define RST_CLK_RTC_CLOCK_HSI_SEL_Msk           ((uint32_t)0x000000F0)
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN            ((uint32_t)0x00000100)
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN            ((uint32_t)0x00000200)

/* HSE SEL Modes */
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE           0x00
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_2     0x08
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_4     0x09
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_8     0x0A
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_16    0x0B
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_32    0x0C
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_64    0x0D
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_128   0x0E
#define RST_CLK_RTC_CLOCK_HSE_SEL_HSE_DIV_256   0x0F

/* HSI SEL Modes */
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI           0x00
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_2     0x08
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_4     0x09
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_8     0x0A
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_16    0x0B
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_32    0x0C
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_64    0x0D
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_128   0x0E
#define RST_CLK_RTC_CLOCK_HSI_SEL_HSI_DIV_256   0x0F

/** @} */ /* End of group RST_CLK_RTC_CLOCK */

/*-- RST_CLK_PER_CLOCK: PER Clock Register ---------------------*/
/* Bit field positions: */
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN1_Pos            0
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN2_Pos            1
#define RST_CLK_PER_CLOCK_PCLK_EN_USB_Pos             2
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_CNTRL_Pos    3
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Pos         4
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA_Pos             5
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1_Pos           6
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2_Pos           7
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI1_Pos            8
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1_Pos  9
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2_Pos  10
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER_Pos           11
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDT_Pos            12
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDT_Pos            13
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Pos          14
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Pos          15
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Pos          16
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC_Pos             17
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC_Pos             18
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Pos          19
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI2_Pos            20
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Pos           21
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Pos           22
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Pos           23
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Pos           24
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Pos           25
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R_Pos       26
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP_Pos             27
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T_Pos       28
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Pos           29
#define RST_CLK_PER_CLOCK_PCLK_EN_EXT_BUS_CNTRL_Pos   30
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI3_Pos            31

/* Bit field masks: */
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN1                ((uint32_t)0x00000001)
#define RST_CLK_PER_CLOCK_PCLK_EN_CAN2                ((uint32_t)0x00000002)
#define RST_CLK_PER_CLOCK_PCLK_EN_USB                 ((uint32_t)0x00000004)
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_CNTRL        ((uint32_t)0x00000008)
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK             ((uint32_t)0x00000010)
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA                 ((uint32_t)0x00000020)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1               ((uint32_t)0x00000040)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2               ((uint32_t)0x00000080)
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI1                ((uint32_t)0x00000100)
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1      ((uint32_t)0x00000200)
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2      ((uint32_t)0x00000400)
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER               ((uint32_t)0x00000800)
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDT                ((uint32_t)0x00001000)
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDT                ((uint32_t)0x00002000)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1              ((uint32_t)0x00004000)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2              ((uint32_t)0x00008000)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3              ((uint32_t)0x00010000)
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC                 ((uint32_t)0x00020000)
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC                 ((uint32_t)0x00040000)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER4              ((uint32_t)0x00080000)
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI2                ((uint32_t)0x00100000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA               ((uint32_t)0x00200000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB               ((uint32_t)0x00400000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC               ((uint32_t)0x00800000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD               ((uint32_t)0x01000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE               ((uint32_t)0x02000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R           ((uint32_t)0x04000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP                 ((uint32_t)0x08000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T           ((uint32_t)0x10000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF               ((uint32_t)0x20000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_EXT_BUS_CNTRL       ((uint32_t)0x40000000)
#define RST_CLK_PER_CLOCK_PCLK_EN_SPI3                ((uint32_t)0x80000000)

/** @} */ /* End of group RST_CLK_PER_CLOCK */

/** @defgroup Periph_RST_CLK_PER_CLOCK  RST CLK PER CLOCK
  * @{
  */


/** @defgroup __1T_Periph_RST_CLK_CAN_CLOCK RST CLK CAN CLOCK
  * @{
  */

