eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/*-- RST_CLK_CAN_CLOCK: CAN Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Pos          0
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Pos          8
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN_Pos       24
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN_Pos       25

/* Bit field masks: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN           ((uint32_t)0x02000000)

/* CAN BRG Modes */
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK          0x00
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_2    0x01
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_4    0x02
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_8    0x03
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_16   0x04
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_32   0x05
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_64   0x06
#define RST_CLK_CAN_CLOCK_CAN_BRG_HCLK_DIV_128  0x07

/** @} */ /* End of group RST_CLK_CAN_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_TIM_CLOCK    RST CLK TIM CLOCK
  * @{
  */

/*-- RST_CLK_TIM_CLOCK: Timer Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Pos          8
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Pos          16
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos       24
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos       25
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos       26

/* Bit field masks: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Msk          ((uint32_t)0x00FF0000)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN           ((uint32_t)0x02000000)
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN           ((uint32_t)0x04000000)

/* TIM BRG Modes */
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK          0x00
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_2    0x01
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_4    0x02
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_8    0x03
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_16   0x04
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_32   0x05
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_64   0x06
#define RST_CLK_TIM_CLOCK_TIM_BRG_HCLK_DIV_128  0x07

/** @} */ /* End of group RST_CLK_TIM_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_UART_CLOCK   RST CLK UART CLOCK
  * @{
  */

/*-- RST_CLK_UART_CLOCK: UART Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Pos        0
#define RST_CLK_UART_CLOCK_UART2_BRG_Pos        8
#define RST_CLK_UART_CLOCK_TIM4_BRG_Pos         16
#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos     24
#define RST_CLK_UART_CLOCK_UART2_CLK_EN_Pos     25
#define RST_CLK_UART_CLOCK_TIM4_CLK_EN_Pos      26

/* Bit field masks: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Msk        ((uint32_t)0x000000FF)
#define RST_CLK_UART_CLOCK_UART2_BRG_Msk        ((uint32_t)0x0000FF00)
#define RST_CLK_UART_CLOCK_TIM4_BRG_Msk         ((uint32_t)0x00FF0000)
#define RST_CLK_UART_CLOCK_UART1_CLK_EN         ((uint32_t)0x01000000)
#define RST_CLK_UART_CLOCK_UART2_CLK_EN         ((uint32_t)0x02000000)
#define RST_CLK_UART_CLOCK_TIM4_CLK_EN          ((uint32_t)0x04000000)

/* UART BRG Modes */
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK            0x00
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_2      0x01
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_4      0x02
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_8      0x03
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_16     0x04
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_32     0x05
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_64     0x06
#define RST_CLK_UART_CLOCK_UART_BRG_HCLK_DIV_128    0x07

/* TIM4 BRG Modes */
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK          0x00
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_2    0x01
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_4    0x02
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_8    0x03
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_16   0x04
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_32   0x05
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_64   0x06
#define RST_CLK_UART_CLOCK_TIM4_BRG_HCLK_DIV_128  0x07

/** @} */ /* End of group RST_CLK_UART_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_SSP_CLOCK    RST CLK SSP CLOCK
  * @{
  */

/*-- RST_CLK_SSP_CLOCK: SSP Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Pos          0
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Pos          8
#define RST_CLK_SSP_CLOCK_SSP3_BRG_Pos          16
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos       24
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Pos       25
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Pos       26

/* Bit field masks: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_Msk          ((uint32_t)0x00FF0000)
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN           ((uint32_t)0x02000000)
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN           ((uint32_t)0x04000000)

/* SSP BRG Modes */
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK          0x00
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_2    0x01
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_4    0x02
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_8    0x03
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_16   0x04
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_32   0x05
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_64   0x06
#define RST_CLK_SSP_CLOCK_SSP_BRG_HCLK_DIV_128  0x07

/** @} */ /* End of group RST_CLK_SSP_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_ETH_CLOCK    RST CLK ETR CLOCK
  * @{
  */

/*-- RST_CLK_ETH_CLOCK: ETH Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_ETH_CLOCK_ETH_BRG_Pos           0
#define RST_CLK_ETH_CLOCK_MAN_BRG_Pos           8
#define RST_CLK_ETH_CLOCK_PHY_BRG_Pos           16
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN_Pos        24
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN_Pos        25
#define RST_CLK_ETH_CLOCK_SLEEP_Pos             26
#define RST_CLK_ETH_CLOCK_PHY_CLK_EN_Pos        27
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Pos       28
#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN_Pos       30

/* Bit field masks: */
#define RST_CLK_ETH_CLOCK_ETH_BRG_Msk           ((uint32_t)0x000000FF)
#define RST_CLK_ETH_CLOCK_MAN_BRG_Msk           ((uint32_t)0x0000FF00)
#define RST_CLK_ETH_CLOCK_PHY_BRG_Msk           ((uint32_t)0x00FF0000)
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN            ((uint32_t)0x01000000)
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN            ((uint32_t)0x02000000)
#define RST_CLK_ETH_CLOCK_SLEEP                 ((uint32_t)0x04000000)
#define RST_CLK_ETH_CLOCK_PHY_CLK_EN            ((uint32_t)0x08000000)
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk       ((uint32_t)0x30000000)
#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN           ((uint32_t)0x40000000)

/* PHY_BRG Modes */
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK          0x00
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_2    0x01
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_4    0x02
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_8    0x03
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_16   0x04
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_32   0x05
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_64   0x06
#define RST_CLK_ETH_CLOCK_PHY_BRG_PHY1_CLK_DIV_128  0x07

