eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/* PHY CLK SEL Modes */
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_HSI           0x00
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_HSE           0x01
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_PLL_CPU       0x02
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_HSE2          0x03

/** @} */ /* End of group RST_CLK_ETH_CLOCK */


/** @defgroup __VE3_Periph_RST_CLK_UART_SSP_CLOCK   RST CLK UART SSP CLOCK
  * @{
  */

/*-- RST_CLK_UART_SSP_CLOCK: UART_SSP Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_UART_SSP_CLOCK_UART3_BRG_Pos        0
#define RST_CLK_UART_SSP_CLOCK_UART4_BRG_Pos        8
#define RST_CLK_UART_SSP_CLOCK_SSP4_BRG_Pos         16
#define RST_CLK_UART_SSP_CLOCK_UART3_CLK_EN_Pos     24
#define RST_CLK_UART_SSP_CLOCK_UART4_CLK_EN_Pos     25
#define RST_CLK_UART_SSP_CLOCK_SSP4_CLK_EN_Pos      26

/* Bit field masks: */
#define RST_CLK_UART_SSP_CLOCK_UART3_BRG_Msk        ((uint32_t)0x000000FF)
#define RST_CLK_UART_SSP_CLOCK_UART4_BRG_Msk        ((uint32_t)0x0000FF00)
#define RST_CLK_UART_SSP_CLOCK_SSP4_BRG_Msk         ((uint32_t)0x00FF0000)
#define RST_CLK_UART_SSP_CLOCK_UART3_CLK_EN         ((uint32_t)0x01000000)
#define RST_CLK_UART_SSP_CLOCK_UART4_CLK_EN         ((uint32_t)0x02000000)
#define RST_CLK_UART_SSP_CLOCK_SSP4_CLK_EN          ((uint32_t)0x04000000)

/** @} */ /* End of group RST_CLK_UART_SSP_CLOCK */


/** @} */ /* End of group Periph_RST_CLK_Defines */

/** @} */ /* End of group Periph_RST_CLK */


/** @defgroup __VE3___MDR1986VE3__Periph_DMA DMA
  * @{
  */

/** @defgroup __VE3_MDR1986VE3_Periph_DMA_Data_Structures Data Structures
  * @{
  */

/* MDR_DMA_TypeDef structure */
typedef struct
{
  __IO uint32_t STATUS;
  __IO uint32_t CFG;
  __IO uint32_t CTRL_BASE_PTR;
  __IO uint32_t ALT_CTRL_BASE_PTR;
  __IO uint32_t WAITONREQ_STATUS;
  __IO uint32_t CHNL_SW_REQUEST;
  __IO uint32_t CHNL_USEBURST_SET;
  __IO uint32_t CHNL_USEBURST_CLR;
  __IO uint32_t CHNL_REQ_MASK_SET;
  __IO uint32_t CHNL_REQ_MASK_CLR;
  __IO uint32_t CHNL_ENABLE_SET;
  __IO uint32_t CHNL_ENABLE_CLR;
  __IO uint32_t CHNL_PRI_ALT_SET;
  __IO uint32_t CHNL_PRI_ALT_CLR;
  __IO uint32_t CHNL_PRIORITY_SET;
  __IO uint32_t CHNL_PRIORITY_CLR;
       uint32_t RESERVED0[3];
  __IO uint32_t ERR_CLR;
}MDR_DMA_TypeDef;

/** @} */ /* End of group MDR1986VE3_Periph_DMA_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_DMA_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_DMA_STATUS   DMA STATUS
  * @{
  */

/*-- DMA_STATUS: DMA Status Register -------------------------------*/
/* Bit field positions: */
#define DMA_STATUS_MASTER_ENABLE_Pos            0
#define DMA_STATUS_STATE_Pos                    4
#define DMA_STATUS_CHNLS_MINUS1_Pos             16
#define DMA_STATUS_TEST_STATUS_Pos              28

/* Bit field masks: */
#define DMA_STATUS_MASTER_ENABLE                ((uint32_t)0x00000001)
#define DMA_STATUS_STATE_Msk                    ((uint32_t)0x000000F0)
#define DMA_STATUS_CHNLS_MINUS1_Msk             ((uint32_t)0x001F0000)
#define DMA_STATUS_TEST_STATUS_Msk              ((uint32_t)0xF0000000)

/** @} */ /* End of group DMA_STATUS */

/** @defgroup __VE3_Periph_DMA_CFG  DMA CFG
  * @{
  */

/*-- DMA_CFG: DMA Configuration Register ---------------------------*/
/* Bit field positions: */
#define DMA_CFG_MASTER_ENABLE_Pos               0
#define DMA_CFG_CHNL_PROT_CTRL_Pos              5

/* Bit field masks: */
#define DMA_CFG_MASTER_ENABLE                   ((uint32_t)0x00000001)
#define DMA_CFG_CHNL_PROT_CTRL_Msk              ((uint32_t)0x000000E0)

/** @} */ /* End of group DMA_CFG */

/** @} */ /* End of group MDR1986VE3_Periph_DMA_Defines */

/** @} */ /* End of group MDR1986VE3_Periph_DMA */


/** @defgroup __VE3___MDR1986VE3__Periph_UART UART
  * @{
  */

/** @defgroup __VE3_Periph_UART_Data_Structures Data Structures
  * @{
  */

/** @defgroup __VE3_Periph_UART_TypeDef UART_TypeDef
  * @{
  */

typedef struct {
  __IO uint32_t DR;
  __IO uint32_t RSR_ECR;
       uint32_t RESERVED0[4];
  __IO uint32_t FR;
       uint32_t RESERVED1;
  __IO uint32_t ILPR;
  __IO uint32_t IBRD;
  __IO uint32_t FBRD;
  __IO uint32_t LCR_H;
  __IO uint32_t CR;
  __IO uint32_t IFLS;
  __IO uint32_t IMSC;
  __IO uint32_t RIS;
  __IO uint32_t MIS;
  __IO uint32_t ICR;
  __IO uint32_t DMACR;
  __IO uint32_t UARTTCR;
} MDR_UART_TypeDef;

/** @} */ /* End of group Periph_UART_TypeDef */

/** @} */ /* End of group Periph_UART_Data_Structures */

/** @defgroup __VE3_Periph_UART_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_UART_DR  UART DR
  * @{
  */

/*-- UART_DR: UART Data Register -----------------------------------*/
/* Bit field positions: */
#define UART_DR_DATA_Pos                        0
#define UART_DR_FE_Pos                          8
#define UART_DR_PE_Pos                          9
#define UART_DR_BE_Pos                          10
#define UART_DR_OE_Pos                          11

/* Bit field masks: */
#define UART_DR_DATA_Msk                        ((uint32_t)0x000000FF)
#define UART_DR_FE                              ((uint32_t)0x00000100)
#define UART_DR_PE                              ((uint32_t)0x00000200)
#define UART_DR_BE                              ((uint32_t)0x00000400)
#define UART_DR_OE                              ((uint32_t)0x00000800)

/** @} */ /* End of group UART_DR */

/** @defgroup __VE3_Periph_UART_RSR_ECR UART RSR ECR
  * @{
  */

/*-- UART_RSR_ECR: UART RSR Register -------------------------------*/
/* Bit field positions: */
#define UART_RSR_ECR_FE_Pos                     0
#define UART_RSR_ECR_PE_Pos                     1
#define UART_RSR_ECR_BE_Pos                     2
#define UART_RSR_ECR_OE_Pos                     3

/* Bit field masks: */
#define UART_RSR_ECR_FE                         ((uint32_t)0x00000001)
#define UART_RSR_ECR_PE                         ((uint32_t)0x00000002)
#define UART_RSR_ECR_BE                         ((uint32_t)0x00000004)
#define UART_RSR_ECR_OE                         ((uint32_t)0x00000008)

/** @} */ /* End of group UART_RSR_ECR */

/** @defgroup __VE3_Periph_UART_FR  UART FR
  * @{
  */

