eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group SPI_SSPx */

/** @defgroup __VE3_Periph_SSP_ICR  SSP ICR
  * @{
  */

/*-- SSP_ICR: SSP Interrupt Clear Register -------------------------*/
/* Bit field positions: */
#define SSP_ICR_RORIC_Pos                       0
#define SSP_ICR_RTIC_Pos                        1

/* Bit field masks: */
#define SSP_ICR_RORIC                           ((uint32_t)0x00000001)
#define SSP_ICR_RTIC                            ((uint32_t)0x00000002)

/** @} */ /* End of group SSP_ICR */

/** @defgroup __VE3_Periph_SSP_DMACR    SSP DMACR
  * @{
  */

/*-- SSP_DMACR: SSP DMA Control Register ---------------------------*/
/* Bit field positions: */
#define SSP_DMACR_RXDMAE_Pos                    0
#define SSP_DMACR_TXDMAE_Pos                    1

/* Bit field masks: */
#define SSP_DMACR_RXDMAE                        ((uint32_t)0x00000001)
#define SSP_DMACR_TXDMAE                        ((uint32_t)0x00000002)

/** @} */ /* End of group SSP_DMACR */

/** @} */ /* End of group Periph_SPI_Defines */

/** @} */ /* End of group Periph_SPI */

/** @defgroup __VE3___MDR1986VE3__Periph_MIL_STD_1553 MIL_STD_1553
  * @{
  */

/** @defgroup __VE3_Periph_MIL_STD_1553_Data_Structures Data Structures
  * @{
  */

/* MDR_MIL_STD_1553_TypeDef structure */
typedef struct {
    uint32_t RESERVED0[1024];
    __IO uint32_t CONTROL;
    __IO uint32_t STATUS;
    __IO uint32_t ERROR;
    __IO uint32_t CommandWord1;
    __IO uint32_t CommandWord2;
    __IO uint32_t ModeData;
    __IO uint32_t StatusWord1;
    __IO uint32_t StatusWord2;
    __IO uint32_t INTEN;
    __IO uint32_t MSG;
} MDR_MIL_STD_1553_TypeDef;

/** @} */ /* End of group Periph_MIL_STD_1553_Data_Structures */

/** @defgroup __VE3_Periph_MIL_STD_1553_Defines Defines
  * @{
  */
/** @defgroup __VE3_Periph_MIL_STD_1553_CONTROL MIL STD 1553 CONTROL
  * @{
  */

/*-- MIL_STD_1553_CONTROL: MIL_STD_1553 Control Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_CONTROL_MR_Pos            0
#define MIL_STD_1553_CONTROL_BCSTART_Pos       1
#define MIL_STD_1553_CONTROL_BCMODE_Pos        2
#define MIL_STD_1553_CONTROL_RTMODE_Pos        3
#define MIL_STD_1553_CONTROL_TRA_Pos           4
#define MIL_STD_1553_CONTROL_TRB_Pos           5
#define MIL_STD_1553_CONTROL_RTA_Pos           6
#define MIL_STD_1553_CONTROL_DIV_Pos           11
#define MIL_STD_1553_CONTROL_RERR_Pos          18
#define MIL_STD_1553_CONTROL_INVTR_Pos         19
#define MIL_STD_1553_CONTROL_ENFILTER_Pos      20
#define MIL_STD_1553_CONTROL_AUTOTUNE_Pos      21

/* Bit field masks: */
#define MIL_STD_1553_CONTROL_MR                 ((uint32_t)0x00000001)
#define MIL_STD_1553_CONTROL_BCSTART            ((uint32_t)0x00000002)
#define MIL_STD_1553_CONTROL_BCMODE             ((uint32_t)0x00000004)
#define MIL_STD_1553_CONTROL_RTMODE             ((uint32_t)0x00000008)
#define MIL_STD_1553_CONTROL_TRA                ((uint32_t)0x00000010)
#define MIL_STD_1553_CONTROL_TRB                ((uint32_t)0x00000020)
#define MIL_STD_1553_CONTROL_RTA_Msk            ((uint32_t)0x000007C0)
#define MIL_STD_1553_CONTROL_DIV_Msk            ((uint32_t)0x0003F800)
#define MIL_STD_1553_CONTROL_RERR               ((uint32_t)0x00040000)
#define MIL_STD_1553_CONTROL_INVTR              ((uint32_t)0x00080000)
#define MIL_STD_1553_CONTROL_ENFILTER           ((uint32_t)0x00100000)
#define MIL_STD_1553_CONTROL_AUTOTUNE           ((uint32_t)0x00200000)

/** @} */ /* End of group MIL_STD_1553_CONTROL */

/** @defgroup __VE3_Periph_MIL_STD_1553_STATUS  MIL STD 1553 STATUS
  * @{
  */

/*-- MIL_STD_1553_STATUS: MIL_STD_1553 Status Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_STATUS_IDLE_Pos                 0
#define MIL_STD_1553_STATUS_RFLAGN_Pos               1
#define MIL_STD_1553_STATUS_VALMESS_Pos              2
#define MIL_STD_1553_STATUS_ERR_Pos                  3
#define MIL_STD_1553_STATUS_RCVA_Pos                 4
#define MIL_STD_1553_STATUS_RCVB_Pos                 5

/* Bit field masks: */
#define MIL_STD_1553_STATUS_IDLE                     ((uint32_t)0x00000001)
#define MIL_STD_1553_STATUS_RFLAGN                   ((uint32_t)0x00000002)
#define MIL_STD_1553_STATUS_VALMESS                  ((uint32_t)0x00000004)
#define MIL_STD_1553_STATUS_ERR                      ((uint32_t)0x00000008)
#define MIL_STD_1553_STATUS_RCVA                     ((uint32_t)0x00000010)
#define MIL_STD_1553_STATUS_RCVB                     ((uint32_t)0x00000020)

/** @} */ /* End of group MIL_STD_1553_STATUS */

/** @defgroup __VE3_Periph_MIL_STD_1553_ERROR   MIL STD 1553 ERROR
  * @{
  */

/*-- MIL_STD_1553_ERROR: MIL_STD_1553 ERROR Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_ERROR_NORCV_Pos           0
#define MIL_STD_1553_ERROR_MANERR_Pos          1
#define MIL_STD_1553_ERROR_SYNCERR_Pos         2
#define MIL_STD_1553_ERROR_SEQERR_Pos          3
#define MIL_STD_1553_ERROR_GAPERR_Pos          4
#define MIL_STD_1553_ERROR_CONERR_Pos          5
#define MIL_STD_1553_ERROR_PROERR_Pos          6

/* Bit field masks: */
#define MIL_STD_1553_ERROR_NORCV                ((uint32_t)0x00000001)
#define MIL_STD_1553_ERROR_MANERR               ((uint32_t)0x00000002)
#define MIL_STD_1553_ERROR_SYNCERR              ((uint32_t)0x00000004)
#define MIL_STD_1553_ERROR_SEQERR               ((uint32_t)0x00000008)
#define MIL_STD_1553_ERROR_GAPERR               ((uint32_t)0x00000010)
#define MIL_STD_1553_ERROR_CONERR               ((uint32_t)0x00000020)
#define MIL_STD_1553_ERROR_PROERR               ((uint32_t)0x00000040)

/** @} */ /* End of group MIL_STD_1553_ERROR */

/** @defgroup __VE3_Periph_MIL_STD_1553_ITEEN   MIL STD 1553 ITEEN
  * @{
  */

/*-- MIL_STD_1553_ITEEN: MIL_STD_1553 ITEEN Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_INTEN_IDLEIE_Pos          0
#define MIL_STD_1553_INTEN_RFLAGNIE_Pos        1
#define MIL_STD_1553_INTEN_VALMESSIE_Pos       2
#define MIL_STD_1553_INTEN_ERRIE_Pos           3

/* Bit field masks: */
#define MIL_STD_1553_INTEN_IDLEIE               ((uint32_t)0x00000001)
#define MIL_STD_1553_INTEN_RFLAGNIE             ((uint32_t)0x00000002)
#define MIL_STD_1553_INTEN_VALMESSIE            ((uint32_t)0x00000004)
#define MIL_STD_1553_INTEN_ERRIE                ((uint32_t)0x00000008)

