eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group MIL_STD_1553_ITEEN */

/** @} */ /* End of group Periph_MIL_STD_1553_Defines */

/** @} */ /* End of group Periph_MIL_STD_1553 */


/** @defgroup __VE3___MDR1986VE3__Periph_POWER POWER
 * @{
 */

/** @defgroup __VE3_MDR1986VE3_Periph_POWER_Data_Structures Data Structures
  * @{
  */

/* MDR_POWER_TypeDef structure */
typedef struct
{
  __IO uint32_t PVDCS;
}MDR_POWER_TypeDef;

/** @} */ /* End of group MDR1986VE3_Periph_POWER_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_POWER_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_POWER_PVDCS  POWER PVDCS
  * @{
  */

/*-- POWER_PVDCS: POWER Power Detector Control/Status Register -----*/
/* Bit field positions: */
#define POWER_PVDCS_PVDEN_Pos                   0
#define POWER_PVDCS_PBLS_Pos                    1
#define POWER_PVDCS_PLS_Pos                     3
#define POWER_PVDCS_PVBD_Pos                    6
#define POWER_PVDCS_PVD_Pos                     7
#define POWER_PVDCS_IEPVBD_Pos                  8
#define POWER_PVDCS_IEPVD_Pos                   9
#define POWER_PVDCS_INVB_Pos                    10
#define POWER_PVDCS_INV_Pos                     11

/* Bit field masks: */
#define POWER_PVDCS_PVDEN                       ((uint32_t)0x00000001)
#define POWER_PVDCS_PBLS_Msk                    ((uint32_t)0x00000006)
#define POWER_PVDCS_PLS_Msk                     ((uint32_t)0x00000038)
#define POWER_PVDCS_PVBD                        ((uint32_t)0x00000040)
#define POWER_PVDCS_PVD                         ((uint32_t)0x00000080)
#define POWER_PVDCS_IEPVBD                      ((uint32_t)0x00000100)
#define POWER_PVDCS_IEPVD                       ((uint32_t)0x00000200)
#define POWER_PVDCS_INVB                        ((uint32_t)0x00000400)
#define POWER_PVDCS_INV                         ((uint32_t)0x00000800)

/** @} */ /* End of group POWER_PVDCS */

/** @} */ /* End of group MDR1986VE3_Periph_POWER_Defines */

/** @} */ /* End of group MDR1986VE3_Periph_POWER */

/** @defgroup __VE3___MDR1986VE3__Periph_WWDG WWDG
  * @{
  */

/** @defgroup __VE3_MDR1986VE3_Periph_WWDG_Data_Structures Data Structures
  * @{
  */

/* MDR_WWDG_TypeDef structure */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFR;
  __IO uint32_t SR;
}MDR_WWDG_TypeDef;

/** @} */ /* End of group MDR1986VE3_Periph_WWDG_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_WWDG_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_WWDG_CR  WWDG CR
  * @{
  */

/*-- WWDG_CR: WWDG Command Register --------------------------------*/
/* Bit field positions: */
#define WWDG_CR_T_Pos                           0
#define WWDG_CR_WDGA_Pos                        7

/* Bit field masks: */
#define WWDG_CR_T_Msk                           ((uint32_t)0x0000007F)
#define WWDG_CR_WDGA                            ((uint32_t)0x00000080)

/** @} */ /* End of group WWDG_CR */

/** @defgroup __VE3_Periph_WWDG_CFR WWDG CFR
  * @{
  */

/*-- WWDG_CFR: WWDG Configuration Register -------------------------*/
/* Bit field positions: */
#define WWDG_CFR_W_Pos                          0
#define WWDG_CFR_WGTB_Pos                       7
#define WWDG_CFR_EWI_Pos                        9

/* Bit field masks: */
#define WWDG_CFR_W_Msk                          ((uint32_t)0x0000007F)
#define WWDG_CFR_WGTB_Msk                       ((uint32_t)0x00000180)
#define WWDG_CFR_EWI                            ((uint32_t)0x00000200)

/* WGTB Modes */
#define WWDG_CFR_WGTB_NO_DIV                    0x00
#define WWDG_CFR_WGTB_DIV_2                     0x01
#define WWDG_CFR_WGTB_DIV_4                     0x02
#define WWDG_CFR_WGTB_DIV_8                     0x03

/** @} */ /* End of group WWDG_CFR */

/** @} */ /* End of group MDR1986VE3_Periph_WWDG_Defines */

/** @} */ /* End of group MDR1986VE3_Periph_WWDG */

/** @defgroup __VE3___MDR1986VE3__Periph_IWDG IWDG
  * @{
  */

/** @defgroup __VE3_MDR1986VE3_Periph_IWDG_Data_Structures Data Structures
  * @{
  */

/* MDR_IWDG_TypeDef structure */
typedef struct
{
  __IO uint32_t KR;
  __IO uint32_t PR;
  __IO uint32_t RLR;
  __IO uint32_t SR;
}MDR_IWDG_TypeDef;

/** @} */ /* End of group MDR1986VE3_Periph_IWDG_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_IWDG_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_IWDG_SR  IWDG SR
  * @{
  */

/*-- IWDG_SR: IWDG Status Register ---------------------------------*/
/* Bit field positions: */
#define IWDG_SR_PVU_Pos                         0
#define IWDG_SR_RVU_Pos                         1

/* Bit field masks: */
#define IWDG_SR_PVU                             ((uint32_t)0x00000001)
#define IWDG_SR_RVU                             ((uint32_t)0x00000002)

/* PR Modes */
#define IWDG_PR_DIV_4                           0x00
#define IWDG_PR_DIV_8                           0x01
#define IWDG_PR_DIV_16                          0x02
#define IWDG_PR_DIV_32                          0x03
#define IWDG_PR_DIV_64                          0x04
#define IWDG_PR_DIV_128                         0x05
#define IWDG_PR_DIV_256                         0x06

/* KR Keys */
#define IWDG_KR_KEY_REG_EN                      0x00005555
#define IWDG_KR_KEY_REWRITE                     0x0000AAAA
#define IWDG_KR_KEY_WORK_EN                     0x0000CCCC

/** @} */ /* End of group IWDG_SR */

/** @} */ /* End of group MDR1986VE3_Periph_IWDG_Defines */

/** @} */ /* End of group MDR1986VE3_Periph_IWDG */


/** @defgroup __VE3___MDR1986VE3__Periph_TIMER TIMER
  * @{
  */

/** @defgroup __VE3_Periph_TIMER_Data_Structures Data Structures
  * @{
  */

/** @defgroup __VE3_Periph_TIMER_TypeDef TIMER_TypeDef
  * @{
  */

typedef struct {
  __IO uint32_t CNT;
  __IO uint32_t PSG;
  __IO uint32_t ARR;
  __IO uint32_t CNTRL;
  __IO uint32_t CCR1;
  __IO uint32_t CCR2;
  __IO uint32_t CCR3;
  __IO uint32_t CCR4;
  __IO uint32_t CH1_CNTRL;
  __IO uint32_t CH2_CNTRL;
  __IO uint32_t CH3_CNTRL;
  __IO uint32_t CH4_CNTRL;
  __IO uint32_t CH1_CNTRL1;
  __IO uint32_t CH2_CNTRL1;
  __IO uint32_t CH3_CNTRL1;
  __IO uint32_t CH4_CNTRL1;
  __IO uint32_t CH1_DTG;
  __IO uint32_t CH2_DTG;
  __IO uint32_t CH3_DTG;
  __IO uint32_t CH4_DTG;
  __IO uint32_t BRKETR_CNTRL;
  __IO uint32_t STATUS;
  __IO uint32_t IE;
  __IO uint32_t DMA_RE;
  __IO uint32_t CH1_CNTRL2;
  __IO uint32_t CH2_CNTRL2;
  __IO uint32_t CH3_CNTRL2;
  __IO uint32_t CH4_CNTRL2;
  __IO uint32_t CCR11;
  __IO uint32_t CCR21;
  __IO uint32_t CCR31;
  __IO uint32_t CCR41;
  __IO uint32_t DMA_REChx[4];
} MDR_TIMER_TypeDef;


/** @} */ /* End of group Periph_TIMER_TypeDef */

/** @} */ /* End of group Periph_TIMER_Data_Structures */

/** @defgroup __VE3_Periph_TIMER_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_TIMER_CNTRL  TIMER CNTRL
  * @{
  */

/*-- TIMER_CNTRL: Timer Control Register ---------------------------*/
/* Bit field positions: */
#define TIMER_CNTRL_CNT_EN_Pos                  0
#define TIMER_CNTRL_ARRB_EN_Pos                 1
#define TIMER_CNTRL_WR_CMPL_Pos                 2
#define TIMER_CNTRL_DIR_Pos                     3
#define TIMER_CNTRL_FDTS_Pos                    4
#define TIMER_CNTRL_CNT_MODE_Pos                6
#define TIMER_CNTRL_EVENT_SEL_Pos               8

/* Bit field masks: */
#define TIMER_CNTRL_CNT_EN                      ((uint32_t)0x00000001)
#define TIMER_CNTRL_ARRB_EN                     ((uint32_t)0x00000002)
#define TIMER_CNTRL_WR_CMPL                     ((uint32_t)0x00000004)
#define TIMER_CNTRL_DIR                         ((uint32_t)0x00000008)
#define TIMER_CNTRL_FDTS_Msk                    ((uint32_t)0x00000030)
#define TIMER_CNTRL_CNT_MODE_Msk                ((uint32_t)0x000000C0)
#define TIMER_CNTRL_EVENT_SEL_Msk               ((uint32_t)0x00000F00)

/* FDTS Modes */
#define TIMER_CNTRL_FDTS_TIM_CLK                0x00
#define TIMER_CNTRL_FDTS_SECOND_TIM_CLK         0x01
#define TIMER_CNTRL_FDTS_THIRD_TIM_CLK          0x02
#define TIMER_CNTRL_FDTS_FOURTH_TIM_CLK         0x03

/* CNT Modes*/
#define TIMER_CNTRL_CNT_MODE_UP_DIR_0_PSG_0             0x00
#define TIMER_CNTRL_CNT_MODE_DOWN_DIR_1_PSG_0           0x00
#define TIMER_CNTRL_CNT_MODE_UP_DOWN_DIR_AUTO_PSG_0     0x01
#define TIMER_CNTRL_CNT_MODE_UP_DIR_0_EVENT_1           0x02
#define TIMER_CNTRL_CNT_MODE_DOWN_DIR_1_EVENT_1         0x02

/* EVENT SEL Modes */
#define TIMER_CNTRL_EVENT_SEL_TIM_CLK           0x00
#define TIMER_CNTRL_EVENT_SEL_CNT_ARR_TIM1      0x01
#define TIMER_CNTRL_EVENT_SEL_CNT_ARR_TIM2      0x02
#define TIMER_CNTRL_EVENT_SEL_CNT_ARR_TIM3      0x03
#define TIMER_CNTRL_EVENT_SEL_CH1               0x04
#define TIMER_CNTRL_EVENT_SEL_CH2               0x05
#define TIMER_CNTRL_EVENT_SEL_CH3               0x06
#define TIMER_CNTRL_EVENT_SEL_CH4               0x07
#define TIMER_CNTRL_EVENT_SEL_ETR_POS_EDGE      0x08
#define TIMER_CNTRL_EVENT_SEL_ETR_NEG_EDGE      0x09
#define TIMER_CNTRL_EVENT_SEL_CNT_ARR_TIM4      0x0A

/** @} */ /* End of group TIMER_CNTRL */

/** @defgroup __VE3_Periph_TIMER_CH_CNTRL   TIMER CH CNTRL
  * @{
  */

/*-- TIMER_CH_CNTRL: Timer Channel Control Register ----------------*/
/* Bit field positions: */
#define TIMER_CH_CNTRL_CHFLTR_Pos               0
#define TIMER_CH_CNTRL_CHSEL_Pos                4
#define TIMER_CH_CNTRL_CHPSC_Pos                6
#define TIMER_CH_CNTRL_OCCE_Pos                 8
#define TIMER_CH_CNTRL_OCCM_Pos                 9
#define TIMER_CH_CNTRL_BRKEN_Pos                12
#define TIMER_CH_CNTRL_ETREN_Pos                13
#define TIMER_CH_CNTRL_WR_CMPL_Pos              14
#define TIMER_CH_CNTRL_CAP_NPWM_Pos             15

/* Bit field masks: */
#define TIMER_CH_CNTRL_CHFLTR_Msk               ((uint32_t)0x0000000F)
#define TIMER_CH_CNTRL_CHSEL_Msk                ((uint32_t)0x00000030)
#define TIMER_CH_CNTRL_CHPSC_Msk                ((uint32_t)0x000000C0)
#define TIMER_CH_CNTRL_OCCE                     ((uint32_t)0x00000100)
#define TIMER_CH_CNTRL_OCCM_Msk                 ((uint32_t)0x00000E00)
#define TIMER_CH_CNTRL_BRKEN                    ((uint32_t)0x00001000)
#define TIMER_CH_CNTRL_ETREN                    ((uint32_t)0x00002000)
#define TIMER_CH_CNTRL_WR_CMPL                  ((uint32_t)0x00004000)
#define TIMER_CH_CNTRL_CAP_NPWM                 ((uint32_t)0x00008000)

/* CHFLTR Modes */
#define TIMER_CH_CNTRL_CHFLTR_1_TRG_TIM_CLK             0x00
#define TIMER_CH_CNTRL_CHFLTR_2_TRG_TIM_CLK             0x01
#define TIMER_CH_CNTRL_CHFLTR_4_TRG_TIM_CLK             0x02
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_TIM_CLK             0x03
#define TIMER_CH_CNTRL_CHFLTR_6_TRG_FDTS_DIV_2          0x04
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_FDTS_DIV_2          0x05
#define TIMER_CH_CNTRL_CHFLTR_6_TRG_FDTS_DIV_4          0x06
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_FDTS_DIV_4          0x07
#define TIMER_CH_CNTRL_CHFLTR_6_TRG_FDTS_DIV_8          0x08
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_FDTS_DIV_8          0x09
#define TIMER_CH_CNTRL_CHFLTR_5_TRG_FDTS_DIV_16         0x0A
#define TIMER_CH_CNTRL_CHFLTR_6_TRG_FDTS_DIV_16         0x0B
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_FDTS_DIV_16         0x0C
#define TIMER_CH_CNTRL_CHFLTR_5_TRG_FDTS_DIV_32         0x0D
#define TIMER_CH_CNTRL_CHFLTR_6_TRG_FDTS_DIV_32         0x0E
#define TIMER_CH_CNTRL_CHFLTR_8_TRG_FDTS_DIV_32         0x0F

/* CHSEL Modes */
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE                   0x00
#define TIMER_CH_CNTRL_CHSEL_NEG_EDGE                   0x01
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH1_FROM_CH2      0x02
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH2_FROM_CH3      0x02
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH3_FROM_CH4      0x02
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH4_FROM_CH1      0x02
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH1_FROM_CH3      0x03
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH2_FROM_CH4      0x03
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH3_FROM_CH1      0x03
#define TIMER_CH_CNTRL_CHSEL_POS_EDGE_CH4_FROM_CH2      0x03

/* CHPSC Modes */
#define TIMER_CH_CNTRL_CHPSC_NO_DIV                     0x00
#define TIMER_CH_CNTRL_CHPSC_DIV_2                      0x01
#define TIMER_CH_CNTRL_CHPSC_DIV_4                      0x02
#define TIMER_CH_CNTRL_CHPSC_DIV_8                      0x03

/* OCCM Modes */
// CCR1 EN = X
#define TIMER_CH_CNTRL_OCCM_REF_0                       0x00
#define TIMER_CH_CNTRL_OCCM_REF_1                       0x05
// CCR1 EN = 0
#define TIMER_CH_CNTRL_OCCM_REF_1_CNT_CCR               0x01
#define TIMER_CH_CNTRL_OCCM_REF_0_CNT_CCR               0x02
#define TIMER_CH_CNTRL_OCCM_SW_REF_CNT_CCR              0x03
#define TIMER_CH_CNTRL_OCCM_REF_1_DIR_0_CNT_CCR         0x06
#define TIMER_CH_CNTRL_OCCM_REF_0_DIR_1_CNT_CCR         0x06
#define TIMER_CH_CNTRL_OCCM_REF_0_DIR_0_CNT_CCR         0x07
#define TIMER_CH_CNTRL_OCCM_REF_1_DIR_1_CNT_CCR         0x07
// CCR1 EN = 1
#define TIMER_CH_CNTRL_OCCM_REF_1_CNT_CCR_OR_CNT_CCR1   0x01
#define TIMER_CH_CNTRL_OCCM_REF_0_CNT_CCR_OR_CNT_CCR1   0x02
#define TIMER_CH_CNTRL_OCCM_SW_REF_CNT_CCR_OR_CNT_CCR1  0x03
#define TIMER_CH_CNTRL_OCCM_REF_1_DIR_0_CCR1_CNT_CCR    0x06
#define TIMER_CH_CNTRL_OCCM_REF_0_DIR_1_CCR_CNT_CCR1    0x06
#define TIMER_CH_CNTRL_OCCM_REF_0_DIR_0_CCR1_CNT_CCR    0x07
#define TIMER_CH_CNTRL_OCCM_REF_1_DIR_1_CCR_CNT_CCR1    0x07

/** @} */ /* End of group TIMER_CH_CNTRL */

/** @defgroup __VE3_Periph_TIMER_CH_CNTRL1 TIMER CH CNTRL1
  * @{
  */

/* Bit field positions: */
#define TIMER_CH_CNTRL1_SELOE_Pos               0
#define TIMER_CH_CNTRL1_SELO_Pos                2
#define TIMER_CH_CNTRL1_INV_Pos                 4
#define TIMER_CH_CNTRL1_NSELOE_Pos              8
#define TIMER_CH_CNTRL1_NSELO_Pos               10
#define TIMER_CH_CNTRL1_NINV_Pos                12

/* Bit field masks: */
#define TIMER_CH_CNTRL1_SELOE_Msk               ((uint32_t)0x00000003)
#define TIMER_CH_CNTRL1_SELO_Msk                ((uint32_t)0x0000000C)
#define TIMER_CH_CNTRL1_INV                     ((uint32_t)0x00000010)
#define TIMER_CH_CNTRL1_NSELOE_Msk              ((uint32_t)0x00000300)
#define TIMER_CH_CNTRL1_NSELO_Msk               ((uint32_t)0x00000C00)
#define TIMER_CH_CNTRL1_NINV                    ((uint32_t)0x00001000)

/* SELOE Modes */
#define TIMER_CH_CNTRL1_SELOE_OUT_DIS           0x00
#define TIMER_CH_CNTRL1_SELOE_OUT_EN            0x01
#define TIMER_CH_CNTRL1_SELOE_OUT_REF_Z_OUT     0x02
#define TIMER_CH_CNTRL1_SELOE_OUT_DTG_Z_OUT     0x03

/* SELO Modes */
#define TIMER_CH_CNTRL1_SELO_OUT_0              0x00
#define TIMER_CH_CNTRL1_SELO_OUT_1              0x01
#define TIMER_CH_CNTRL1_SELO_OUT_REF            0x02
#define TIMER_CH_CNTRL1_SELO_OUT_DTG            0x03

/** @} */ /* End of group Periph_TIMER_CH_CNTRL1 */

/** @defgroup __VE3_Periph_TIMER_CH_DTG TIMER CH DTG
  * @{
  */

/*-- TIMER_CH_DTG: Timer Channel DTG Register ----------------------*/
/* Bit field positions: */
#define TIMER_CH_DTGX_Pos                       0
#define TIMER_CH_DTG_EDTS_Pos                   4
#define TIMER_CH_DTG_Pos                        8

/* Bit field masks: */
#define TIMER_CH_DTGX_Msk                       ((uint32_t)0x0000000F)
#define TIMER_CH_DTG_EDTS                       ((uint32_t)0x00000010)
#define TIMER_CH_DTG_Msk                        ((uint32_t)0x0000FF00)

/** @} */ /* End of group TIMER_CH_DTG */

/** @defgroup __VE3_Periph_TIMER_BRKETR_CNTRL   TIMER BRKETR CNTRL
  * @{
  */

/*-- TIMER_BRKETR_CNTRL: Timer BRK/ETR Control Register ------------*/
/* Bit field positions: */
#define TIMER_BRKETR_CNTRL_BRK_INV_Pos          0
#define TIMER_BRKETR_CNTRL_ETR_INV_Pos          1
#define TIMER_BRKETR_CNTRL_ETR_PSC_Pos          2
#define TIMER_BRKETR_CNTRL_ETR_FILTER_Pos       4

/* Bit field masks: */
#define TIMER_BRKETR_CNTRL_BRK_INV              ((uint32_t)0x00000001)
#define TIMER_BRKETR_CNTRL_ETR_INV              ((uint32_t)0x00000002)
#define TIMER_BRKETR_CNTRL_ETR_PSC_Msk          ((uint32_t)0x0000000C)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_Msk       ((uint32_t)0x000000F0)

/* ETR PSC Modes */
#define TIMER_BRKETR_CNTRL_ETR_PSC_NO_DIV       0x00
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_2        0x01
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_4        0x02
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_8        0x03

