eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group PORT_PULL */

/** @defgroup __VE3_Periph_PORT_PD  PORT PD
  * @{
  */

/*-- PORT_PD: PORT Driver Mode Register ----------------------------*/
/* Bit field positions: */
#define PORT_PD_Pos                             0
#define PORT_PD_SHM_Pos                         16

/* Bit field masks: */
#define PORT_PD_Msk                             ((uint32_t)0x0000FFFF)
#define PORT_PD_SHM_Msk                         ((uint32_t)0xFFFF0000)

/** @} */ /* End of group PORT_PD */

/** @defgroup __VE3_Periph_PORT_PWR PORT PWR
  * @{
  */

/*-- PORT_PWR: PORT Power Register ---------------------------------*/
/* Bit field positions: */
#define PORT_PWR0_Pos                           0
#define PORT_PWR1_Pos                           2
#define PORT_PWR2_Pos                           4
#define PORT_PWR3_Pos                           6
#define PORT_PWR4_Pos                           8
#define PORT_PWR5_Pos                           10
#define PORT_PWR6_Pos                           12
#define PORT_PWR7_Pos                           14
#define PORT_PWR8_Pos                           16
#define PORT_PWR9_Pos                           18
#define PORT_PWR10_Pos                          20
#define PORT_PWR11_Pos                          22
#define PORT_PWR12_Pos                          24
#define PORT_PWR13_Pos                          26
#define PORT_PWR14_Pos                          28
#define PORT_PWR15_Pos                          30

/* Bit field masks: */
#define PORT_PWR_Msk                            3U
#define PORT_PWR0_Msk                           ((uint32_t)0x00000003)
#define PORT_PWR1_Msk                           ((uint32_t)0x0000000C)
#define PORT_PWR2_Msk                           ((uint32_t)0x00000030)
#define PORT_PWR3_Msk                           ((uint32_t)0x000000C0)
#define PORT_PWR4_Msk                           ((uint32_t)0x00000300)
#define PORT_PWR5_Msk                           ((uint32_t)0x00000C00)
#define PORT_PWR6_Msk                           ((uint32_t)0x00003000)
#define PORT_PWR7_Msk                           ((uint32_t)0x0000C000)
#define PORT_PWR8_Msk                           ((uint32_t)0x00030000)
#define PORT_PWR9_Msk                           ((uint32_t)0x000C0000)
#define PORT_PWR10_Msk                          ((uint32_t)0x00300000)
#define PORT_PWR11_Msk                          ((uint32_t)0x00C00000)
#define PORT_PWR12_Msk                          ((uint32_t)0x03000000)
#define PORT_PWR13_Msk                          ((uint32_t)0x0C000000)
#define PORT_PWR14_Msk                          ((uint32_t)0x30000000)
#define PORT_PWR15_Msk                          ((uint32_t)0xC0000000)

/* PORT PWR Modes */
#define PORT_PWR_OFF        0U
#define PORT_PWR_SLOW       1U
#define PORT_PWR_FAST       2U
#define PORT_PWR_MAX_FAST   3U

/** @} */ /* End of group PORT_PWR */

/** @} */ /* End of group Periph_PORT_Defines */

/** @} */ /* End of group Periph_PORT */

/** @defgroup __VE3___MDR1986VE3__Periph_ARINC429R ARINC429R
  * @{
  */

/** @defgroup __VE3_MDR1986Ve3_Periph_ARINC429R_Data_Structures Data Structures
  * @{
  */

/* MDR_ARINC429R_TypeDef structure */
typedef struct
{
    __IO uint32_t CONTROL1;
    __IO uint32_t CONTROL2;
    __IO uint32_t CONTROL3;
    __IO uint32_t STATUS1;
    __IO uint32_t STATUS2;
    __IO uint32_t CONTROL4;
    __IO uint32_t CONTROL5;
    __IO uint32_t CHANNEL;
    __IO uint32_t LABEL;
    __IO uint32_t DATA_R;
    __IO uint32_t CONTROL6;
    __IO uint32_t CONTROL7;
    __IO uint32_t DATA_R_Direct[14];
    __IO uint32_t INTMASK1;
    __IO uint32_t INTMASK2;
    __IO uint32_t CONTROL8;
    __IO uint32_t CONTROL9;
}MDR_ARINC429R_TypeDef;

/** @} */ /* End of group Periph_ARINC429R_Data_Structures */

/** @defgroup __VE3_MDR1986VE3_Periph_ARINC429R_Defines Defines
  * @{
  */

/** @defgroup __VE3_Periph_ARINC429R_CONTROL1   ARINC429R CONTROL1
  * @{
  */

/*-- ARINC429R_CONTROL1: ARINC429R CONTROL1 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL1_CH_EN1_Pos          0
#define ARINC429R_CONTROL1_CH_EN2_Pos          1
#define ARINC429R_CONTROL1_CH_EN3_Pos          2
#define ARINC429R_CONTROL1_CH_EN4_Pos          3
#define ARINC429R_CONTROL1_CH_EN5_Pos          4
#define ARINC429R_CONTROL1_CH_EN6_Pos          5
#define ARINC429R_CONTROL1_CH_EN7_Pos          6
#define ARINC429R_CONTROL1_CH_EN8_Pos          7
#define ARINC429R_CONTROL1_CH_EN9_Pos          8
#define ARINC429R_CONTROL1_CH_EN10_Pos         9
#define ARINC429R_CONTROL1_CH_EN11_Pos         10
#define ARINC429R_CONTROL1_CH_EN12_Pos         11
#define ARINC429R_CONTROL1_CH_EN13_Pos         12
#define ARINC429R_CONTROL1_CH_EN14_Pos         13
#define ARINC429R_CONTROL1_CLK1_Pos            14
#define ARINC429R_CONTROL1_CLK2_Pos            15
#define ARINC429R_CONTROL1_CLK3_Pos            16
#define ARINC429R_CONTROL1_CLK4_Pos            17
#define ARINC429R_CONTROL1_CLK5_Pos            18
#define ARINC429R_CONTROL1_CLK6_Pos            19
#define ARINC429R_CONTROL1_CLK7_Pos            20
#define ARINC429R_CONTROL1_CLK8_Pos            21
#define ARINC429R_CONTROL1_CLK9_Pos            22
#define ARINC429R_CONTROL1_CLK10_Pos           23
#define ARINC429R_CONTROL1_CLK11_Pos           24
#define ARINC429R_CONTROL1_CLK12_Pos           25
#define ARINC429R_CONTROL1_CLK13_Pos           26
#define ARINC429R_CONTROL1_CLK14_Pos           27
#define ARINC429R_CONTROL1_DIV_Pos             28

/* Bit field masks: */
#define ARINC429R_CONTROL1_CH_EN1               ((uint32_t)0x00000001)
#define ARINC429R_CONTROL1_CH_EN2               ((uint32_t)0x00000002)
#define ARINC429R_CONTROL1_CH_EN3               ((uint32_t)0x00000004)
#define ARINC429R_CONTROL1_CH_EN4               ((uint32_t)0x00000008)
#define ARINC429R_CONTROL1_CH_EN5               ((uint32_t)0x00000010)
#define ARINC429R_CONTROL1_CH_EN6               ((uint32_t)0x00000020)
#define ARINC429R_CONTROL1_CH_EN7               ((uint32_t)0x00000040)
#define ARINC429R_CONTROL1_CH_EN8               ((uint32_t)0x00000080)
#define ARINC429R_CONTROL1_CH_EN9               ((uint32_t)0x00000100)
#define ARINC429R_CONTROL1_CH_EN10              ((uint32_t)0x00000200)
#define ARINC429R_CONTROL1_CH_EN11              ((uint32_t)0x00000400)
#define ARINC429R_CONTROL1_CH_EN12              ((uint32_t)0x00000800)
#define ARINC429R_CONTROL1_CH_EN13              ((uint32_t)0x00001000)
#define ARINC429R_CONTROL1_CH_EN14              ((uint32_t)0x00002000)
#define ARINC429R_CONTROL1_CLK1                 ((uint32_t)0x00004000)
#define ARINC429R_CONTROL1_CLK2                 ((uint32_t)0x00008000)
#define ARINC429R_CONTROL1_CLK3                 ((uint32_t)0x00010000)
#define ARINC429R_CONTROL1_CLK4                 ((uint32_t)0x00020000)
#define ARINC429R_CONTROL1_CLK5                 ((uint32_t)0x00040000)
#define ARINC429R_CONTROL1_CLK6                 ((uint32_t)0x00080000)
#define ARINC429R_CONTROL1_CLK7                 ((uint32_t)0x00100000)
#define ARINC429R_CONTROL1_CLK8                 ((uint32_t)0x00200000)
#define ARINC429R_CONTROL1_CLK9                 ((uint32_t)0x00400000)
#define ARINC429R_CONTROL1_CLK10                ((uint32_t)0x00800000)
#define ARINC429R_CONTROL1_CLK11                ((uint32_t)0x01000000)
#define ARINC429R_CONTROL1_CLK12                ((uint32_t)0x02000000)
#define ARINC429R_CONTROL1_CLK13                ((uint32_t)0x04000000)
#define ARINC429R_CONTROL1_CLK14                ((uint32_t)0x08000000)
#define ARINC429R_CONTROL1_DIV_Msk              ((uint32_t)0xF0000000)

