eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group ARINC429R_CONTROL1 */

/** @defgroup __VE3_Periph_ARICN429R_CONTROL2   ARICN429R CONTROL2
  * @{
  */

/*-- ARICN429R_CONTROL2: ARICN429R CONTROL2 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL2_DIV_6_4_Pos         0
#define ARINC429R_CONTROL2_LB_EN1_Pos          3
#define ARINC429R_CONTROL2_LB_EN2_Pos          4
#define ARINC429R_CONTROL2_LB_EN3_Pos          5
#define ARINC429R_CONTROL2_LB_EN4_Pos          6
#define ARINC429R_CONTROL2_LB_EN5_Pos          7
#define ARINC429R_CONTROL2_LB_EN6_Pos          8
#define ARINC429R_CONTROL2_LB_EN7_Pos          9
#define ARINC429R_CONTROL2_LB_EN8_Pos          10
#define ARINC429R_CONTROL2_LB_EN9_Pos          11
#define ARINC429R_CONTROL2_LB_EN10_Pos         12
#define ARINC429R_CONTROL2_LB_EN11_Pos         13
#define ARINC429R_CONTROL2_LB_EN12_Pos         14
#define ARINC429R_CONTROL2_LB_EN13_Pos         15
#define ARINC429R_CONTROL2_LB_EN14_Pos         16
#define ARINC429R_CONTROL2_SD_EN1_Pos          17
#define ARINC429R_CONTROL2_SD_EN2_Pos          18
#define ARINC429R_CONTROL2_SD_EN3_Pos          19
#define ARINC429R_CONTROL2_SD_EN4_Pos          20
#define ARINC429R_CONTROL2_SD_EN5_Pos          21
#define ARINC429R_CONTROL2_SD_EN6_Pos          22
#define ARINC429R_CONTROL2_SD_EN7_Pos          23
#define ARINC429R_CONTROL2_SD_EN8_Pos          24
#define ARINC429R_CONTROL2_SD_EN9_Pos          25
#define ARINC429R_CONTROL2_SD_EN10_Pos         26
#define ARINC429R_CONTROL2_SD_EN11_Pos         27
#define ARINC429R_CONTROL2_SD_EN12_Pos         28
#define ARINC429R_CONTROL2_SD_EN13_Pos         29
#define ARINC429R_CONTROL2_SD_EN14_Pos         30
#define ARINC429R_CONTROL2_DA_Pos              31

/* Bit field masks: */
#define ARINC429R_CONTROL2_DIV_6_4_Msk          ((uint32_t)0x00000007)
#define ARINC429R_CONTROL2_LB_EN1               ((uint32_t)0x00000008)
#define ARINC429R_CONTROL2_LB_EN2               ((uint32_t)0x00000010)
#define ARINC429R_CONTROL2_LB_EN3               ((uint32_t)0x00000020)
#define ARINC429R_CONTROL2_LB_EN4               ((uint32_t)0x00000040)
#define ARINC429R_CONTROL2_LB_EN5               ((uint32_t)0x00000080)
#define ARINC429R_CONTROL2_LB_EN6               ((uint32_t)0x00000100)
#define ARINC429R_CONTROL2_LB_EN7               ((uint32_t)0x00000200)
#define ARINC429R_CONTROL2_LB_EN8               ((uint32_t)0x00000400)
#define ARINC429R_CONTROL2_LB_EN9               ((uint32_t)0x00000800)
#define ARINC429R_CONTROL2_LB_EN10              ((uint32_t)0x00001000)
#define ARINC429R_CONTROL2_LB_EN11              ((uint32_t)0x00002000)
#define ARINC429R_CONTROL2_LB_EN12              ((uint32_t)0x00004000)
#define ARINC429R_CONTROL2_LB_EN13              ((uint32_t)0x00008000)
#define ARINC429R_CONTROL2_LB_EN14              ((uint32_t)0x00010000)
#define ARINC429R_CONTROL2_SD_EN1               ((uint32_t)0x00020000)
#define ARINC429R_CONTROL2_SD_EN2               ((uint32_t)0x00040000)
#define ARINC429R_CONTROL2_SD_EN3               ((uint32_t)0x00080000)
#define ARINC429R_CONTROL2_SD_EN4               ((uint32_t)0x00100000)
#define ARINC429R_CONTROL2_SD_EN5               ((uint32_t)0x00200000)
#define ARINC429R_CONTROL2_SD_EN6               ((uint32_t)0x00400000)
#define ARINC429R_CONTROL2_SD_EN7               ((uint32_t)0x00800000)
#define ARINC429R_CONTROL2_SD_EN8               ((uint32_t)0x01000000)
#define ARINC429R_CONTROL2_SD_EN9               ((uint32_t)0x02000000)
#define ARINC429R_CONTROL2_SD_EN10              ((uint32_t)0x04000000)
#define ARINC429R_CONTROL2_SD_EN11              ((uint32_t)0x08000000)
#define ARINC429R_CONTROL2_SD_EN12              ((uint32_t)0x10000000)
#define ARINC429R_CONTROL2_SD_EN13              ((uint32_t)0x20000000)
#define ARINC429R_CONTROL2_SD_EN14              ((uint32_t)0x40000000)
#define ARINC429R_CONTROL2_DA                   ((uint32_t)0x80000000)

/*-- ARINC429R_CONTROL3: ARINC429R CONTROL3 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL3_SDI1_1_Pos          0
#define ARINC429R_CONTROL3_SDI1_2_Pos          1
#define ARINC429R_CONTROL3_SDI1_3_Pos          2
#define ARINC429R_CONTROL3_SDI1_4_Pos          3
#define ARINC429R_CONTROL3_SDI1_5_Pos          4
#define ARINC429R_CONTROL3_SDI1_6_Pos          5
#define ARINC429R_CONTROL3_SDI1_7_Pos          6
#define ARINC429R_CONTROL3_SDI1_8_Pos          7
#define ARINC429R_CONTROL3_SDI1_9_Pos          8
#define ARINC429R_CONTROL3_SDI1_10_Pos         9
#define ARINC429R_CONTROL3_SDI1_11_Pos         10
#define ARINC429R_CONTROL3_SDI1_12_Pos         11
#define ARINC429R_CONTROL3_SDI1_13_Pos         12
#define ARINC429R_CONTROL3_SDI1_14_Pos         13
#define ARINC429R_CONTROL3_SDI2_1_Pos          14
#define ARINC429R_CONTROL3_SDI2_2_Pos          15
#define ARINC429R_CONTROL3_SDI2_3_Pos          16
#define ARINC429R_CONTROL3_SDI2_4_Pos          17
#define ARINC429R_CONTROL3_SDI2_5_Pos          18
#define ARINC429R_CONTROL3_SDI2_6_Pos          19
#define ARINC429R_CONTROL3_SDI2_7_Pos          20
#define ARINC429R_CONTROL3_SDI2_8_Pos          21
#define ARINC429R_CONTROL3_SDI2_9_Pos          22
#define ARINC429R_CONTROL3_SDI2_10_Pos         23
#define ARINC429R_CONTROL3_SDI2_11_Pos         24
#define ARINC429R_CONTROL3_SDI2_12_Pos         25
#define ARINC429R_CONTROL3_SDI2_13_Pos         26
#define ARINC429R_CONTROL3_SDI2_14_Pos         27
#define ARINC429R_CONTROL3_INTEDR_Pos          28
#define ARINC429R_CONTROL3_INTEER_Pos          29
#define ARINC429R_CONTROL3_INTEFF_Pos          30
#define ARINC429R_CONTROL3_INTEHF_Pos          31

/** @} */ /* End of group ARICN429R_CONTROL2 */

/* Bit field masks: */
#define ARINC429R_CONTROL3_SDI1_1               ((uint32_t)0x00000001)
#define ARINC429R_CONTROL3_SDI1_2               ((uint32_t)0x00000002)
#define ARINC429R_CONTROL3_SDI1_3               ((uint32_t)0x00000004)
#define ARINC429R_CONTROL3_SDI1_4               ((uint32_t)0x00000008)
#define ARINC429R_CONTROL3_SDI1_5               ((uint32_t)0x00000010)
#define ARINC429R_CONTROL3_SDI1_6               ((uint32_t)0x00000020)
#define ARINC429R_CONTROL3_SDI1_7               ((uint32_t)0x00000040)
#define ARINC429R_CONTROL3_SDI1_8               ((uint32_t)0x00000080)
#define ARINC429R_CONTROL3_SDI1_9               ((uint32_t)0x00000100)
#define ARINC429R_CONTROL3_SDI1_10              ((uint32_t)0x00000200)
#define ARINC429R_CONTROL3_SDI1_11              ((uint32_t)0x00000400)
#define ARINC429R_CONTROL3_SDI1_12              ((uint32_t)0x00000800)
#define ARINC429R_CONTROL3_SDI1_13              ((uint32_t)0x00001000)
#define ARINC429R_CONTROL3_SDI1_14              ((uint32_t)0x00002000)
#define ARINC429R_CONTROL3_SDI2_1               ((uint32_t)0x00004000)
#define ARINC429R_CONTROL3_SDI2_2               ((uint32_t)0x00008000)
#define ARINC429R_CONTROL3_SDI2_3               ((uint32_t)0x00010000)
#define ARINC429R_CONTROL3_SDI2_4               ((uint32_t)0x00020000)
#define ARINC429R_CONTROL3_SDI2_5               ((uint32_t)0x00040000)
#define ARINC429R_CONTROL3_SDI2_6               ((uint32_t)0x00080000)
#define ARINC429R_CONTROL3_SDI2_7               ((uint32_t)0x00100000)
#define ARINC429R_CONTROL3_SDI2_8               ((uint32_t)0x00200000)
#define ARINC429R_CONTROL3_SDI2_9               ((uint32_t)0x00400000)
#define ARINC429R_CONTROL3_SDI2_10              ((uint32_t)0x00800000)
#define ARINC429R_CONTROL3_SDI2_11              ((uint32_t)0x01000000)
#define ARINC429R_CONTROL3_SDI2_12              ((uint32_t)0x02000000)
#define ARINC429R_CONTROL3_SDI2_13              ((uint32_t)0x04000000)
#define ARINC429R_CONTROL3_SDI2_14              ((uint32_t)0x08000000)
#define ARINC429R_CONTROL3_INTEDR               ((uint32_t)0x10000000)
#define ARINC429R_CONTROL3_INTEER               ((uint32_t)0x20000000)
#define ARINC429R_CONTROL3_INTEFF               ((uint32_t)0x40000000)
#define ARINC429R_CONTROL3_INTEHF               ((uint32_t)0x80000000)

