eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @defgroup __VE3_Periph_ARINC429R_CONTROL4   ARINC429R CONTROL4
  * @{
  */

/*-- ARINC429R_CONTROL4: ARINC429R CONTROL4 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL4_DIV_CH1_Pos               0
#define ARINC429R_CONTROL4_DIV_CH2_Pos               8
#define ARINC429R_CONTROL4_DIV_CH3_Pos               16
#define ARINC429R_CONTROL4_DIV_CH4_Pos               24

/* Bit field masks: */
#define ARINC429R_CONTROL4_DIV_CH1_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL4_DIV_CH2_Msk               ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL4_DIV_CH3_Msk               ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL4_DIV_CH4_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC429R_CONTROL4 */

/** @defgroup __VE3_Periph_ARINC492R_CONTROL5   ARINC492R CONTROL5
  * @{
  */

/*-- ARINC492R_CONTROL5: ARINC492R CONTROL5 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL5_DIV_CH5_Pos               0
#define ARINC429R_CONTROL5_DIV_CH6_Pos               8
#define ARINC429R_CONTROL5_DIV_CH7_Pos               16
#define ARINC429R_CONTROL5_DIV_CH8_Pos               24

/* Bit field masks: */
#define ARINC429R_CONTROL5_DIV_CH5_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL5_DIV_CH6_Msk               ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL5_DIV_CH7_Msk               ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL5_DIV_CH8_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC492R_CONTROL5 */

/** @defgroup __VE3_Periph_ARINC429R_CONTROL6   ARINC429R CONTROL6
  * @{
  */

/*-- ARINC429R_CONTROL6: ARINC429R CONTROL6 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL6_DIV_CH9_Pos               0
#define ARINC429R_CONTROL6_DIV_CH10_Pos              8
#define ARINC429R_CONTROL6_DIV_CH11_Pos              16
#define ARINC429R_CONTROL6_DIV_CH12_Pos              24

/* Bit field masks: */
#define ARINC429R_CONTROL6_DIV_CH9_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL6_DIV_CH10_Msk              ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL6_DIV_CH11_Msk              ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL6_DIV_CH12_Msk              ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC429R_CONTROL6 */

/** @defgroup __VE3_Periph_ARINC429R_CONTROL7   ARINC429R CONTROL7
  * @{
  */

/*-- ARINC429R_CONTROL7: ARINC429R CONTROL7 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL7_DIV_CH9_Pos               0
#define ARINC429R_CONTROL7_DIV_CH10_Pos              8

/* Bit field masks: */
#define ARINC429R_CONTROL7_DIV_CH13_Msk              ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL7_DIV_CH14_Msk              ((uint32_t)0x0000FF00)

/** @} */ /* End of group ARINC429R_CONTROL7 */

/** @defgroup __VE3_Periph_ARINC492R_CONTROL8   ARINC492 CONTROL8
  * @{
  */

/*-- ARINC492R_CONTROL8: ARINC492R CONTROL8 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL8_ENPAR1_Pos               0
#define ARINC429R_CONTROL8_ENPAR2_Pos               1
#define ARINC429R_CONTROL8_ENPAR3_Pos               2
#define ARINC429R_CONTROL8_ENPAR4_Pos               3
#define ARINC429R_CONTROL8_ENPAR5_Pos               4
#define ARINC429R_CONTROL8_ENPAR6_Pos               5
#define ARINC429R_CONTROL8_ENPAR7_Pos               6
#define ARINC429R_CONTROL8_ENPAR8_Pos               7
#define ARINC429R_CONTROL8_ENPAR9_Pos               8
#define ARINC429R_CONTROL8_ENPAR10_Pos              9
#define ARINC429R_CONTROL8_ENPAR11_Pos              10
#define ARINC429R_CONTROL8_ENPAR12_Pos              11
#define ARINC429R_CONTROL8_ENPAR13_Pos              12
#define ARINC429R_CONTROL8_ENPAR14_Pos              13
#define ARINC429R_CONTROL8_ODD1_Pos                 14
#define ARINC429R_CONTROL8_ODD2_Pos                 15
#define ARINC429R_CONTROL8_ODD3_Pos                 16
#define ARINC429R_CONTROL8_ODD4_Pos                 17
#define ARINC429R_CONTROL8_ODD5_Pos                 18
#define ARINC429R_CONTROL8_ODD6_Pos                 19
#define ARINC429R_CONTROL8_ODD7_Pos                 20
#define ARINC429R_CONTROL8_ODD8_Pos                 21
#define ARINC429R_CONTROL8_ODD9_Pos                 22
#define ARINC429R_CONTROL8_ODD10_Pos                23
#define ARINC429R_CONTROL8_ODD11_Pos                24
#define ARINC429R_CONTROL8_ODD12_Pos                25
#define ARINC429R_CONTROL8_ODD13_Pos                26
#define ARINC429R_CONTROL8_ODD14_Pos                27
#define ARINC429R_CONTROL8_DA0_Pos                  28
#define ARINC429R_CONTROL8_DA1_Pos                  29

/* Bit field masks: */
#define ARINC429R_CONTROL8_ENPAR1                   ((uint32_t)0x00000001)
#define ARINC429R_CONTROL8_ENPAR2                   ((uint32_t)0x00000002)
#define ARINC429R_CONTROL8_ENPAR3                   ((uint32_t)0x00000004)
#define ARINC429R_CONTROL8_ENPAR4                   ((uint32_t)0x00000008)
#define ARINC429R_CONTROL8_ENPAR5                   ((uint32_t)0x00000010)
#define ARINC429R_CONTROL8_ENPAR6                   ((uint32_t)0x00000020)
#define ARINC429R_CONTROL8_ENPAR7                   ((uint32_t)0x00000040)
#define ARINC429R_CONTROL8_ENPAR8                   ((uint32_t)0x00000080)
#define ARINC429R_CONTROL8_ENPAR9                   ((uint32_t)0x00000100)
#define ARINC429R_CONTROL8_ENPAR10                  ((uint32_t)0x00000200)
#define ARINC429R_CONTROL8_ENPAR11                  ((uint32_t)0x00000400)
#define ARINC429R_CONTROL8_ENPAR12                  ((uint32_t)0x00000800)
#define ARINC429R_CONTROL8_ENPAR13                  ((uint32_t)0x00001000)
#define ARINC429R_CONTROL8_ENPAR14                  ((uint32_t)0x00002000)
#define ARINC429R_CONTROL8_ODD1                     ((uint32_t)0x00004000)
#define ARINC429R_CONTROL8_ODD2                     ((uint32_t)0x00008000)
#define ARINC429R_CONTROL8_ODD3                     ((uint32_t)0x00010000)
#define ARINC429R_CONTROL8_ODD4                     ((uint32_t)0x00020000)
#define ARINC429R_CONTROL8_ODD5                     ((uint32_t)0x00040000)
#define ARINC429R_CONTROL8_ODD6                     ((uint32_t)0x00080000)
#define ARINC429R_CONTROL8_ODD7                     ((uint32_t)0x00100000)
#define ARINC429R_CONTROL8_ODD8                     ((uint32_t)0x00200000)
#define ARINC429R_CONTROL8_ODD9                     ((uint32_t)0x00400000)
#define ARINC429R_CONTROL8_ODD10                    ((uint32_t)0x00800000)
#define ARINC429R_CONTROL8_ODD11                    ((uint32_t)0x01000000)
#define ARINC429R_CONTROL8_ODD12                    ((uint32_t)0x02000000)
#define ARINC429R_CONTROL8_ODD13                    ((uint32_t)0x04000000)
#define ARINC429R_CONTROL8_ODD14                    ((uint32_t)0x08000000)
#define ARINC429R_CONTROL8_DA0                      ((uint32_t)0x10000000)
#define ARINC429R_CONTROL8_DA1                      ((uint32_t)0x20000000)

/** @} */ /* End of group ARINC492R_CONTROL8 */

/** @defgroup __VE3_Periph_ARINC492R_CONTROL9   ARINC492 CONTROL9
  * @{
  */

