eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/*-- ARINC492R_CONTROL9: ARINC492R CONTROL9 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL9_ENSYNC1_Pos              0
#define ARINC429R_CONTROL9_ENSYNC2_Pos              1
#define ARINC429R_CONTROL9_ENSYNC3_Pos              2
#define ARINC429R_CONTROL9_ENSYNC4_Pos              3
#define ARINC429R_CONTROL9_ENSYNC5_Pos              4
#define ARINC429R_CONTROL9_ENSYNC6_Pos              5
#define ARINC429R_CONTROL9_ENSYNC7_Pos              6
#define ARINC429R_CONTROL9_ENSYNC8_Pos              7
#define ARINC429R_CONTROL9_ENSYNC9_Pos              8
#define ARINC429R_CONTROL9_ENSYNC10_Pos             9
#define ARINC429R_CONTROL9_ENSYNC11_Pos             10
#define ARINC429R_CONTROL9_ENSYNC12_Pos             11
#define ARINC429R_CONTROL9_ENSYNC13_Pos             12
#define ARINC429R_CONTROL9_ENSYNC14_Pos             13

/* Bit field masks: */
#define ARINC429R_CONTROL9_ENSYNC1                  ((uint32_t)0x00000001)
#define ARINC429R_CONTROL9_ENSYNC2                  ((uint32_t)0x00000002)
#define ARINC429R_CONTROL9_ENSYNC3                  ((uint32_t)0x00000004)
#define ARINC429R_CONTROL9_ENSYNC4                  ((uint32_t)0x00000008)
#define ARINC429R_CONTROL9_ENSYNC5                  ((uint32_t)0x00000010)
#define ARINC429R_CONTROL9_ENSYNC6                  ((uint32_t)0x00000020)
#define ARINC429R_CONTROL9_ENSYNC7                  ((uint32_t)0x00000040)
#define ARINC429R_CONTROL9_ENSYNC8                  ((uint32_t)0x00000080)
#define ARINC429R_CONTROL9_ENSYNC9                  ((uint32_t)0x00000100)
#define ARINC429R_CONTROL9_ENSYNC10                 ((uint32_t)0x00000200)
#define ARINC429R_CONTROL9_ENSYNC11                 ((uint32_t)0x00000400)
#define ARINC429R_CONTROL9_ENSYNC12                 ((uint32_t)0x00000800)
#define ARINC429R_CONTROL9_ENSYNC13                 ((uint32_t)0x00001000)
#define ARINC429R_CONTROL9_ENSYNC14                 ((uint32_t)0x00002000)

/** @} */ /* End of group ARINC492R_CONTROL9 */

/** @defgroup __VE3_Periph_ARINC429R_INTMASK1   ARINC429R INTMASK1
  * @{
  */

/*-- ARINC429R_INTMASK1: ARINC429R INTMASK1 register -----*/
/* Bit field positions: */
#define ARINC429R_INTMASK1_IEDR1_Pos                0
#define ARINC429R_INTMASK1_IEER1_Pos                1
#define ARINC429R_INTMASK1_IEFF1_Pos                2
#define ARINC429R_INTMASK1_IEHF1_Pos                3
#define ARINC429R_INTMASK1_IEDR2_Pos                4
#define ARINC429R_INTMASK1_IEER2_Pos                5
#define ARINC429R_INTMASK1_IEFF2_Pos                6
#define ARINC429R_INTMASK1_IEHF2_Pos                7
#define ARINC429R_INTMASK1_IEDR3_Pos                8
#define ARINC429R_INTMASK1_IEER3_Pos                9
#define ARINC429R_INTMASK1_IEFF3_Pos                10
#define ARINC429R_INTMASK1_IEHF3_Pos                11
#define ARINC429R_INTMASK1_IEDR4_Pos                12
#define ARINC429R_INTMASK1_IEER4_Pos                13
#define ARINC429R_INTMASK1_IEFF4_Pos                14
#define ARINC429R_INTMASK1_IEHF4_Pos                15
#define ARINC429R_INTMASK1_IEDR5_Pos                16
#define ARINC429R_INTMASK1_IEER5_Pos                17
#define ARINC429R_INTMASK1_IEFF5_Pos                18
#define ARINC429R_INTMASK1_IEHF5_Pos                19
#define ARINC429R_INTMASK1_IEDR6_Pos                20
#define ARINC429R_INTMASK1_IEER6_Pos                21
#define ARINC429R_INTMASK1_IEFF6_Pos                22
#define ARINC429R_INTMASK1_IEHF6_Pos                23
#define ARINC429R_INTMASK1_IEDR7_Pos                24
#define ARINC429R_INTMASK1_IEER7_Pos                25
#define ARINC429R_INTMASK1_IEFF7_Pos                26
#define ARINC429R_INTMASK1_IEHF7_Pos                27
#define ARINC429R_INTMASK1_IEDR8_Pos                28
#define ARINC429R_INTMASK1_IEER8_Pos                29
#define ARINC429R_INTMASK1_IEFF8_Pos                30
#define ARINC429R_INTMASK1_IEHF8_Pos                31

/* Bit field masks: */
#define ARINC429R_INTMASK1_IEDR1                    ((uint32_t)0x00000001)
#define ARINC429R_INTMASK1_IEER1                    ((uint32_t)0x00000002)
#define ARINC429R_INTMASK1_IEFF1                    ((uint32_t)0x00000004)
#define ARINC429R_INTMASK1_IEHF1                    ((uint32_t)0x00000008)
#define ARINC429R_INTMASK1_IEDR2                    ((uint32_t)0x00000010)
#define ARINC429R_INTMASK1_IEER2                    ((uint32_t)0x00000020)
#define ARINC429R_INTMASK1_IEFF2                    ((uint32_t)0x00000040)
#define ARINC429R_INTMASK1_IEHF2                    ((uint32_t)0x00000080)
#define ARINC429R_INTMASK1_IEDR3                    ((uint32_t)0x00000100)
#define ARINC429R_INTMASK1_IEER3                    ((uint32_t)0x00000200)
#define ARINC429R_INTMASK1_IEFF3                    ((uint32_t)0x00000400)
#define ARINC429R_INTMASK1_IEHF3                    ((uint32_t)0x00000800)
#define ARINC429R_INTMASK1_IEDR4                    ((uint32_t)0x00001000)
#define ARINC429R_INTMASK1_IEER4                    ((uint32_t)0x00002000)
#define ARINC429R_INTMASK1_IEFF4                    ((uint32_t)0x00004000)
#define ARINC429R_INTMASK1_IEHF4                    ((uint32_t)0x00008000)
#define ARINC429R_INTMASK1_IEDR5                    ((uint32_t)0x00010000)
#define ARINC429R_INTMASK1_IEER5                    ((uint32_t)0x00020000)
#define ARINC429R_INTMASK1_IEFF5                    ((uint32_t)0x00040000)
#define ARINC429R_INTMASK1_IEHF5                    ((uint32_t)0x00080000)
#define ARINC429R_INTMASK1_IEDR6                    ((uint32_t)0x00100000)
#define ARINC429R_INTMASK1_IEER6                    ((uint32_t)0x00200000)
#define ARINC429R_INTMASK1_IEFF6                    ((uint32_t)0x00400000)
#define ARINC429R_INTMASK1_IEHF6                    ((uint32_t)0x00800000)
#define ARINC429R_INTMASK1_IEDR7                    ((uint32_t)0x01000000)
#define ARINC429R_INTMASK1_IEER7                    ((uint32_t)0x02000000)
#define ARINC429R_INTMASK1_IEFF7                    ((uint32_t)0x04000000)
#define ARINC429R_INTMASK1_IEHF7                    ((uint32_t)0x08000000)
#define ARINC429R_INTMASK1_IEDR8                    ((uint32_t)0x10000000)
#define ARINC429R_INTMASK1_IEER8                    ((uint32_t)0x20000000)
#define ARINC429R_INTMASK1_IEFF8                    ((uint32_t)0x40000000)
#define ARINC429R_INTMASK1_IEHF8                    ((uint32_t)0x80000000)

/** @} */ /* End of group ARINC429R_INTMASK1 */

/** @defgroup __VE3_Periph_ARINC429R_INTMASK2   ARINC429R INTMASK2
  * @{
  */

/*-- ARINC429R_INTMASK2: ARINC429R INTMASK2 register -----*/
/* Bit field positions: */
#define ARINC429R_INTMASK2_IEDR9_Pos                0
#define ARINC429R_INTMASK2_IEER9_Pos                1
#define ARINC429R_INTMASK2_IEFF9_Pos                2
#define ARINC429R_INTMASK2_IEHF9_Pos                3
#define ARINC429R_INTMASK2_IEDR10_Pos               4
#define ARINC429R_INTMASK2_IEER10_Pos               5
#define ARINC429R_INTMASK2_IEFF10_Pos               6
#define ARINC429R_INTMASK2_IEHF10_Pos               7
#define ARINC429R_INTMASK2_IEDR11_Pos               8
#define ARINC429R_INTMASK2_IEER11_Pos               9
#define ARINC429R_INTMASK2_IEFF11_Pos               10
#define ARINC429R_INTMASK2_IEHF11_Pos               11
#define ARINC429R_INTMASK2_IEDR12_Pos               12
#define ARINC429R_INTMASK2_IEER12_Pos               13
#define ARINC429R_INTMASK2_IEFF12_Pos               14
#define ARINC429R_INTMASK2_IEHF12_Pos               15
#define ARINC429R_INTMASK2_IEDR13_Pos               16
#define ARINC429R_INTMASK2_IEER13_Pos               17
#define ARINC429R_INTMASK2_IEFF13_Pos               18
#define ARINC429R_INTMASK2_IEHF13_Pos               19
#define ARINC429R_INTMASK2_IEDR14_Pos               20
#define ARINC429R_INTMASK2_IEER14_Pos               21
#define ARINC429R_INTMASK2_IEFF14_Pos               22
#define ARINC429R_INTMASK2_IEHF14_Pos               23

/* Bit field masks: */
#define ARINC429R_INTMASK2_IEDR9                    ((uint32_t)0x00000001)
#define ARINC429R_INTMASK2_IEER9                    ((uint32_t)0x00000002)
#define ARINC429R_INTMASK2_IEFF9                    ((uint32_t)0x00000004)
#define ARINC429R_INTMASK2_IEHF9                    ((uint32_t)0x00000008)
#define ARINC429R_INTMASK2_IEDR10                   ((uint32_t)0x00000010)
#define ARINC429R_INTMASK2_IEER10                   ((uint32_t)0x00000020)
#define ARINC429R_INTMASK2_IEFF10                   ((uint32_t)0x00000040)
#define ARINC429R_INTMASK2_IEHF10                   ((uint32_t)0x00000080)
#define ARINC429R_INTMASK2_IEDR11                   ((uint32_t)0x00000100)
#define ARINC429R_INTMASK2_IEER11                   ((uint32_t)0x00000200)
#define ARINC429R_INTMASK2_IEFF11                   ((uint32_t)0x00000400)
#define ARINC429R_INTMASK2_IEHF11                   ((uint32_t)0x00000800)
#define ARINC429R_INTMASK2_IEDR12                   ((uint32_t)0x00001000)
#define ARINC429R_INTMASK2_IEER12                   ((uint32_t)0x00002000)
#define ARINC429R_INTMASK2_IEFF12                   ((uint32_t)0x00004000)
#define ARINC429R_INTMASK2_IEHF12                   ((uint32_t)0x00008000)
#define ARINC429R_INTMASK2_IEDR13                   ((uint32_t)0x00010000)
#define ARINC429R_INTMASK2_IEER13                   ((uint32_t)0x00020000)
#define ARINC429R_INTMASK2_IEFF13                   ((uint32_t)0x00040000)
#define ARINC429R_INTMASK2_IEHF13                   ((uint32_t)0x00080000)
#define ARINC429R_INTMASK2_IEDR14                   ((uint32_t)0x00100000)
#define ARINC429R_INTMASK2_IEER14                   ((uint32_t)0x00200000)
#define ARINC429R_INTMASK2_IEFF14                   ((uint32_t)0x00400000)
#define ARINC429R_INTMASK2_IEHF14                   ((uint32_t)0x00800000)

