eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group ARINC429R_INTMASK2 */

/** @defgroup __VE3_Periph_ARINC429R_STATUS1    ARINC429R STATUS1
  * @{
  */

/*-- ARINC429R_STATUS1: ARINC429R STATUS1 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS1_DR1_Pos              0
#define ARINC429R_STATUS1_DR2_Pos              1
#define ARINC429R_STATUS1_DR3_Pos              2
#define ARINC429R_STATUS1_DR4_Pos              3
#define ARINC429R_STATUS1_DR5_Pos              4
#define ARINC429R_STATUS1_DR6_Pos              5
#define ARINC429R_STATUS1_DR7_Pos              6
#define ARINC429R_STATUS1_DR8_Pos              7
#define ARINC429R_STATUS1_DR9_Pos              8
#define ARINC429R_STATUS1_DR10_Pos             9
#define ARINC429R_STATUS1_DR11_Pos             10
#define ARINC429R_STATUS1_DR12_Pos             11
#define ARINC429R_STATUS1_DR13_Pos             12
#define ARINC429R_STATUS1_DR14_Pos             13
#define ARINC429R_STATUS1_ERR1_Pos             14
#define ARINC429R_STATUS1_ERR2_Pos             15
#define ARINC429R_STATUS1_ERR3_Pos             16
#define ARINC429R_STATUS1_ERR4_Pos             17
#define ARINC429R_STATUS1_ERR5_Pos             18
#define ARINC429R_STATUS1_ERR6_Pos             19
#define ARINC429R_STATUS1_ERR7_Pos             20
#define ARINC429R_STATUS1_ERR8_Pos             21
#define ARINC429R_STATUS1_ERR9_Pos             22
#define ARINC429R_STATUS1_ERR10_Pos            23
#define ARINC429R_STATUS1_ERR11_Pos            24
#define ARINC429R_STATUS1_ERR12_Pos            25
#define ARINC429R_STATUS1_ERR13_Pos            26
#define ARINC429R_STATUS1_ERR14_Pos            27

/* Bit field masks: */
#define ARINC429R_STATUS1_DR1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS1_DR2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS1_DR3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS1_DR4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS1_DR5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS1_DR6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS1_DR7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS1_DR8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS1_DR9                   ((uint32_t)0x00000100)
#define ARINC429R_STATUS1_DR10                  ((uint32_t)0x00000200)
#define ARINC429R_STATUS1_DR11                  ((uint32_t)0x00000400)
#define ARINC429R_STATUS1_DR12                  ((uint32_t)0x00000800)
#define ARINC429R_STATUS1_DR13                  ((uint32_t)0x00001000)
#define ARINC429R_STATUS1_DR14                  ((uint32_t)0x00002000)
#define ARINC429R_STATUS1_ERR1                  ((uint32_t)0x00004000)
#define ARINC429R_STATUS1_ERR2                  ((uint32_t)0x00008000)
#define ARINC429R_STATUS1_ERR3                  ((uint32_t)0x00010000)
#define ARINC429R_STATUS1_ERR4                  ((uint32_t)0x00020000)
#define ARINC429R_STATUS1_ERR5                  ((uint32_t)0x00040000)
#define ARINC429R_STATUS1_ERR6                  ((uint32_t)0x00080000)
#define ARINC429R_STATUS1_ERR7                  ((uint32_t)0x00100000)
#define ARINC429R_STATUS1_ERR8                  ((uint32_t)0x00200000)
#define ARINC429R_STATUS1_ERR9                  ((uint32_t)0x00400000)
#define ARINC429R_STATUS1_ERR10                 ((uint32_t)0x00800000)
#define ARINC429R_STATUS1_ERR11                 ((uint32_t)0x01000000)
#define ARINC429R_STATUS1_ERR12                 ((uint32_t)0x02000000)
#define ARINC429R_STATUS1_ERR13                 ((uint32_t)0x04000000)
#define ARINC429R_STATUS1_ERR14                 ((uint32_t)0x08000000)

/** @} */ /* End of group ARINC429R_STATUS1 */

/** @defgroup __VE3_Periph_ARINC429R_STATUS2    ARINC429R STATUS2
  * @{
  */

/*-- ARINC429R_STATUS2: ARINC429R STATUS2 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS2_FF1_Pos              0
#define ARINC429R_STATUS2_FF2_Pos              1
#define ARINC429R_STATUS2_FF3_Pos              2
#define ARINC429R_STATUS2_FF4_Pos              3
#define ARINC429R_STATUS2_FF5_Pos              4
#define ARINC429R_STATUS2_FF6_Pos              5
#define ARINC429R_STATUS2_FF7_Pos              6
#define ARINC429R_STATUS2_FF8_Pos              7
#define ARINC429R_STATUS2_FF9_Pos              8
#define ARINC429R_STATUS2_FF10_Pos             9
#define ARINC429R_STATUS2_FF11_Pos             10
#define ARINC429R_STATUS2_FF12_Pos             11
#define ARINC429R_STATUS2_FF13_Pos             12
#define ARINC429R_STATUS2_FF14_Pos             13
#define ARINC429R_STATUS2_HF1_Pos              14
#define ARINC429R_STATUS2_HF2_Pos              15
#define ARINC429R_STATUS2_HF3_Pos              16
#define ARINC429R_STATUS2_HF4_Pos              17
#define ARINC429R_STATUS2_HF5_Pos              18
#define ARINC429R_STATUS2_HF6_Pos              19
#define ARINC429R_STATUS2_HF7_Pos              20
#define ARINC429R_STATUS2_HF8_Pos              21
#define ARINC429R_STATUS2_HF9_Pos              22
#define ARINC429R_STATUS2_HF10_Pos             23
#define ARINC429R_STATUS2_HF11_Pos             24
#define ARINC429R_STATUS2_HF12_Pos             25
#define ARINC429R_STATUS2_HF13_Pos             26
#define ARINC429R_STATUS2_HF14_Pos             27

/* Bit field masks: */
#define ARINC429R_STATUS2_FF1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS2_FF2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS2_FF3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS2_FF4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS2_FF5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS2_FF6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS2_FF7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS2_FF8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS2_FF9                   ((uint32_t)0x00000100)
#define ARINC429R_STATUS2_FF10                  ((uint32_t)0x00000200)
#define ARINC429R_STATUS2_FF11                  ((uint32_t)0x00000400)
#define ARINC429R_STATUS2_FF12                  ((uint32_t)0x00000800)
#define ARINC429R_STATUS2_FF13                  ((uint32_t)0x00001000)
#define ARINC429R_STATUS2_FF14                  ((uint32_t)0x00002000)
#define ARINC429R_STATUS2_HF1                   ((uint32_t)0x00004000)
#define ARINC429R_STATUS2_HF2                   ((uint32_t)0x00008000)
#define ARINC429R_STATUS2_HF3                   ((uint32_t)0x00010000)
#define ARINC429R_STATUS2_HF4                   ((uint32_t)0x00020000)
#define ARINC429R_STATUS2_HF5                   ((uint32_t)0x00040000)
#define ARINC429R_STATUS2_HF6                   ((uint32_t)0x00080000)
#define ARINC429R_STATUS2_HF7                   ((uint32_t)0x00100000)
#define ARINC429R_STATUS2_HF8                   ((uint32_t)0x00200000)
#define ARINC429R_STATUS2_HF9                   ((uint32_t)0x00400000)
#define ARINC429R_STATUS2_HF10                  ((uint32_t)0x00800000)
#define ARINC429R_STATUS2_HF11                  ((uint32_t)0x01000000)
#define ARINC429R_STATUS2_HF12                  ((uint32_t)0x02000000)
#define ARINC429R_STATUS2_HF13                  ((uint32_t)0x04000000)
#define ARINC429R_STATUS2_HF14                  ((uint32_t)0x08000000)

/** @} */ /* End of group ARINC429R_STATUS2 */

