eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group ETH_IFR */

/** @defgroup __VE3_Periph_ETH_STAT ETH STAT
  * @{
  */

/*-- ETH_STAT: ETH STAT Register -----*/
/* Bit field positions: */
#define ETH_STAT_R_EMPTY_Pos            0
#define ETH_STAT_R_AEMPTY_Pos           1
#define ETH_STAT_R_HALF_Pos             2
#define ETH_STAT_R_AFULL_Pos            3
#define ETH_STAT_R_FULL_Pos             4
#define ETH_STAT_R_COUNT_Pos            5
#define ETH_STAT_X_EMPTY_Pos            8
#define ETH_STAT_X_AEMPTY_Pos           9
#define ETH_STAT_X_HALF_Pos             10
#define ETH_STAT_X_AFULL_Pos            11
#define ETH_STAT_X_FULL_Pos             12

/* Bit field masks: */
#define ETH_STAT_R_EMPTY                ((uint32_t)0x00000001)
#define ETH_STAT_R_AEMPTY               ((uint32_t)0x00000002)
#define ETH_STAT_R_HALF                 ((uint32_t)0x00000004)
#define ETH_STAT_R_AFULL                ((uint32_t)0x00000008)
#define ETH_STAT_R_FULL                 ((uint32_t)0x00000010)
#define ETH_STAT_R_COUNT_Msk            ((uint32_t)0x000000E0)
#define ETH_STAT_X_EMPTY                ((uint32_t)0x00000100)
#define ETH_STAT_X_AEMPTY               ((uint32_t)0x00000200)
#define ETH_STAT_X_HALF                 ((uint32_t)0x00000400)
#define ETH_STAT_X_AFULL                ((uint32_t)0x00000800)
#define ETH_STAT_X_FULL                 ((uint32_t)0x00001000)

/** @} */ /* End of group ETH_STAT */

/** @defgroup __VE3_Periph_ETH_MDIO_CTRL    ETH MDIO CTRL
  * @{
  */

/*-- ETH_MDIO_CTRL: ETH MDIO_CTRL Register -----*/
/* Bit field positions: */
#define ETH_MDIO_CTRL_RG_A_Pos          0
#define ETH_MDIO_CTRL_DIV_Pos           5
#define ETH_MDIO_CTRL_PHY_A_Pos         8
#define ETH_MDIO_CTRL_OP_Pos            13
#define ETH_MDIO_CTRL_PRE_EN_Pos        14
#define ETH_MDIO_CTRL_RDY_Pos           15

/* Bit field masks: */
#define ETH_MDIO_CTRL_RG_A_Msk          ((uint32_t)0x0000001F)
#define ETH_MDIO_CTRL_DIV_Msk           ((uint32_t)0x000000E0)
#define ETH_MDIO_CTRL_PHY_A_Msk         ((uint32_t)0x00001F00)
#define ETH_MDIO_CTRL_OP                ((uint32_t)0x00002000)
#define ETH_MDIO_CTRL_PRE_EN            ((uint32_t)0x00004000)
#define ETH_MDIO_CTRL_RDY               ((uint32_t)0x00008000)

/** @} */ /* End of group ETH_MDIO_CTRL */

/** @defgroup __VE3_Periph_ETH_PHY_CONTROL  ETH PHY CONTROL
  * @{
  */

/*-- ETH_PHY_CONTROL: ETH PHY_CONTROL Register -----*/
/* Bit field positions: */
#define ETH_PHY_CONTROL_nRST_Pos        0
#define ETH_PHY_CONTROL_MODE_Pos        1
#define ETH_PHY_CONTROL_FX_EN_Pos       7
#define ETH_PHY_CONTROL_MDI_Pos         8
#define ETH_PHY_CONTROL_MDIO_SEL_Pos    9
#define ETH_PHY_CONTROL_MDC_Pos         10
#define ETH_PHY_CONTROL_PHYADD_Pos      11

/* Bit field masks: */
#define ETH_PHY_CONTROL_nRST            ((uint32_t)0x00000001)
#define ETH_PHY_CONTROL_MODE_Msk        ((uint32_t)0x0000000E)
#define ETH_PHY_CONTROL_FX_EN           ((uint32_t)0x00000080)
#define ETH_PHY_CONTROL_MDI             ((uint32_t)0x00000100)
#define ETH_PHY_CONTROL_MDIO_SEL        ((uint32_t)0x00000200)
#define ETH_PHY_CONTROL_MDC             ((uint32_t)0x00000400)
#define ETH_PHY_CONTROL_PHYADD_Msk      ((uint32_t)0x0000F800)

/* PHY Modes */
#define ETH_PHY_CONTROL_MODE_10M_HD         0x00
#define ETH_PHY_CONTROL_MODE_10M_FD         0x01
#define ETH_PHY_CONTROL_MODE_100M_HD        0x02
#define ETH_PHY_CONTROL_MODE_100M_FD        0x03
#define ETH_PHY_CONTROL_MODE_100M_HD_AUTO   0x04
#define ETH_PHY_CONTROL_MODE_REPEAT         0x05
#define ETH_PHY_CONTROL_MODE_LOW_POWER      0x06
#define ETH_PHY_CONTROL_MODE_AUTO           0x07

/** @} */ /* End of group ETH_PHY_CONTROL */

/** @defgroup __VE3_Periph_ETH_PHY_STATUS   ETH PHY STATUS
  * @{
  */

/*-- ETH_PHY_STATUS: ETH PHY_STATUS Register -----*/
/* Bit field positions: */
#define ETH_PHY_STATUS_LED0_Pos         0
#define ETH_PHY_STATUS_LED1_Pos         1
#define ETH_PHY_STATUS_LED2_Pos         2
#define ETH_PHY_STATUS_LED3_Pos         3
#define ETH_PHY_STATUS_READY_Pos        4
#define ETH_PHY_STATUS_CRS_Pos          5
#define ETH_PHY_STATUS_COL_Pos          6
#define ETH_PHY_STATUS_FX_VALID_Pos     8
#define ETH_PHY_STATUS_MDO_Pos          9
#define ETH_PHY_STATUS_MDINT_Pos        10

/* Bit field masks: */
#define ETH_PHY_STATUS_LED0             ((uint32_t)0x00000001)
#define ETH_PHY_STATUS_LED1             ((uint32_t)0x00000002)
#define ETH_PHY_STATUS_LED2             ((uint32_t)0x00000004)
#define ETH_PHY_STATUS_LED3             ((uint32_t)0x00000008)
#define ETH_PHY_STATUS_READY            ((uint32_t)0x00000010)
#define ETH_PHY_STATUS_CRS              ((uint32_t)0x00000020)
#define ETH_PHY_STATUS_COL_Msk          ((uint32_t)0x000000C0)
#define ETH_PHY_STATUS_FX_VALID         ((uint32_t)0x00000100)
#define ETH_PHY_STATUS_MDO              ((uint32_t)0x00000200)
#define ETH_PHY_STATUS_MDINT            ((uint32_t)0x00000400)

/** @} */ /* End of group ETH_PHY_STATUS */

/* PHY Read Write Timeouts */
#define PHY_READ_TO               ((uint32_t)0x0004FFFF)
#define PHY_WRITE_TO              ((uint32_t)0x0004FFFF)

/* PHY Register address */
#define PHY_BCR       0          /* Basic Control Register */
#define PHY_BSR       1          /* Basic Status Register */
#define PHY_ID1       2
#define PHY_ID2       3
#define PHY_ATU       4
#define PHY_OPP_ATU   5
#define PHY_EATU      6
#define PHY_EMODE     18
#define PHY_IT_FLAGs  29
#define PHY_IT_MASKs  30
#define PHY_ECTR      31

/*-- ETH_PHY_BCR: ETH PHY_BCR Register -----*/
/* Bit field positions: */
#define PHY_BCR_COL_TEST_Pos      7
#define PHY_BCR_DUPLEX_MODE_Pos   8
#define PHY_BCR_RST_AUTO_NEG_Pos  9
#define PHY_BCR_ISOLATE_Pos       10
#define PHY_BCR_POWER_DOWN_Pos    11
#define PHY_BCR_AUTO_NEG_EN_Pos   12
#define PHY_BCR_SPEED_SEL_Pos     13
#define PHY_BCR_LOOPBACK_Pos      14
#define PHY_BCR_RST_Pos           15

/* Bit field masks: */
#define PHY_BCR_COL_TEST          ((uint16_t) 0x0080)
#define PHY_BCR_DUPLEX_MODE       ((uint16_t) 0x0100)
#define PHY_BCR_RST_AUTO_NEG      ((uint16_t) 0x0200)
#define PHY_BCR_ISOLATE           ((uint16_t) 0x0400)
#define PHY_BCR_POWER_DOWN        ((uint16_t) 0x0800)
#define PHY_BCR_AUTO_NEG_EN       ((uint16_t) 0x1000)
#define PHY_BCR_SPEED_SEL         ((uint16_t) 0x2000)
#define PHY_BCR_LOOPBACK          ((uint16_t) 0x4000)
#define PHY_BCR_RST               ((uint16_t) 0x8000)

#define MDR_ETHERNET1_BUF_BASE    (0x38000000)
#define MDR_ETHERNET1_BUF_SIZE    8192
#define MDR_ETHERNET2_BUF_BASE    (0x3C000000)
#define MDR_ETHERNET2_BUF_SIZE    8192

