eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @} */ /* End of group MDR1986VE3_Periph_ETHERNET Defines */

/** @} */ /* End of group MDR1986VE3_Periph_ETHERNET */

/** @defgroup __MDR1986VE3_Periph_AUDIO_IP AUDIO_IP
  * @{
  */

/** @defgroup __MDR1986VE3_Periph_AUDIO_IP_Data_Structures Data Structures
  * @{
  */

/* MDR_AUDIO_IP_TypeDef structure */
typedef struct
{
    __IO uint32_t POWCTL;
    __IO uint32_t ADCCTL;
    __IO uint32_t DACCTL;
    __IO uint32_t MASKCTL;
    __IO uint32_t IRQFLAG;
    __IO uint32_t ADCREG;
    __IO uint32_t DACREG;
}MDR_AUDIO_IP_TypeDef;

/** @} */ /* End of group Periph_AUDIO_IP_Data_Structures */

/** @defgroup __MDR1986VE3_Periph_AUDIO_IP_Defines Defines
  * @{
  */
/** @defgroup AUDIO_IP_POWCTL AUDIO_IP POWCTL
  * @{
  */
/*-- AUDIO_IP_POWCTL: AUDIO_IP POWCTL Register -----*/
/* Bit field positions: */
#define AUDIO_IP_POWCTL_ADCEN_Pos               0
#define AUDIO_IP_POWCTL_DACEN_Pos               1
#define AUDIO_IP_POWCTL_IIREN_Pos               2
#define AUDIO_IP_POWCTL_ALB_Pos                 3
#define AUDIO_IP_POWCTL_DLB_Pos                 4

/* Bit field masks: */
#define AUDIO_IP_POWCTL_ADCEN                   ((uint32_t)0x00000001)
#define AUDIO_IP_POWCTL_DACEN                   ((uint32_t)0x00000002)
#define AUDIO_IP_POWCTL_IIEN                    ((uint32_t)0x00000004)
#define AUDIO_IP_POWCTL_ALB                     ((uint32_t)0x00000008)
#define AUDIO_IP_POWCTL_DLB                     ((uint32_t)0x00000010)

/** @} */ /* End of group AUDIO_IP_POWCTL */

/** @defgroup AUDIO_IP_ADCCTL AUDIO_IP ADCCTL
  * @{
  */

/*-- AUDIO_IP_ADCCTL: AUDIO_IP ADCCTL Register -----*/
/* Bit field positions: */
#define AUDIO_IP_ADCCTL_ADGAIN_Pos               0
#define AUDIO_IP_ADCCTL_INBG_Pos                 6
#define AUDIO_IP_ADCCTL_AINSEL_Pos               8
#define AUDIO_IP_ADCCTL_ICONT_Pos               10

/* Bit field masks: */
#define AUDIO_IP_ADCCTL_ADGAIN_Msk                 ((uint32_t)0x0000003F)
#define AUDIO_IP_ADCCTL_INBG_Msk                   ((uint32_t)0x000000C0)
#define AUDIO_IP_ADCCTL_AINSEL_Msk                 ((uint32_t)0x00000300)
#define AUDIO_IP_ADCCTL_ICONT_Msk                  ((uint32_t)0x00000C00)

/** @} */ /* End of group AUDIO_IP_ADCCTL */

/** @defgroup AUDIO_IP_DACCTL AUDIO_IP DACCTL
  * @{
  */

/*-- AUDIO_IP_DACCTL: AUDIO_IP DACCTL Register -----*/
/* Bit field positions: */
#define AUDIO_IP_DACCTL_DAGAIN_Pos               0
#define AUDIO_IP_DACCTL_MUTE1_Pos                6
#define AUDIO_IP_DACCTL_ODAMP_Pos                7
#define AUDIO_IP_DACCTL_ODBIAS_Pos               8
#define AUDIO_IP_DACCTL_ODDAC_Pos                9
#define AUDIO_IP_DACCTL_OVECBA_Pos               10
#define AUDIO_IP_DACCTL_OVECBS_Pos               11
#define AUDIO_IP_DACCTL_SIDETONE_Pos             12
#define AUDIO_IP_DACCTL_DACRES_Pos               15

/* Bit field masks: */
#define AUDIO_IP_DACCTL_DAGAIN_Msk                  ((uint32_t)0x0000003F)
#define AUDIO_IP_DACCTL_MUTE1                       ((uint32_t)0x00000040)
#define AUDIO_IP_DACCTL_ODAMP                       ((uint32_t)0x00000080)
#define AUDIO_IP_DACCTL_ODBIAS                      ((uint32_t)0x00000100)
#define AUDIO_IP_DACCTL_ODDAC                       ((uint32_t)0x00000200)
#define AUDIO_IP_DACCTL_OVECBA                      ((uint32_t)0x00000400)
#define AUDIO_IP_DACCTL_OVECBS                      ((uint32_t)0x00000800)
#define AUDIO_IP_DACCTL_SIDETONE_Msk                ((uint32_t)0x00007040)
#define AUDIO_IP_DACCTL_DACRES                      ((uint32_t)0x00008000)

/** @} */ /* End of group AUDIO_IP_DACCTL */

/** @defgroup AUDIO_IP_MASKCTL AUDIO_IP MASKCTL
  * @{
  */

/*-- AUDIO_IP_MASKCTL: AUDIO_IP MASKCTL Register -----*/
/* Bit field positions: */
#define AUDIO_IP_MASKCTL_DAOVFM_Pos              0
#define AUDIO_IP_MASKCTL_ADCVFM_Pos              1
#define AUDIO_IP_MASKCTL_ADCNSM_Pos              2
#define AUDIO_IP_MASKCTL_OVERCURM_Pos            3

/* Bit field masks: */
#define AUDIO_IP_MASKCTL_DAOVFM                 ((uint32_t)0x00000001)
#define AUDIO_IP_MASKCTL_ADCVFM                 ((uint32_t)0x00000002)
#define AUDIO_IP_MASKCTL_ADCNSM                 ((uint32_t)0x00000004)
#define AUDIO_IP_MASKCTL_OVERCURM               ((uint32_t)0x00000008)

/** @} */ /* End of group AUDIO_IP_MASKCTL */

/** @defgroup AUDIO_IP_IRQFLAG AUDIO_IP IRQFLAG
  * @{
  */

/*-- AUDIO_IP_IRQFLAG: AUDIO_IP IRQFLAG Register -----*/
/* Bit field positions: */
#define AUDIO_IP_IRQFLAG_DAOVFM_Pos              0
#define AUDIO_IP_IRQFLAG_ADCVFM_Pos              1
#define AUDIO_IP_IRQFLAG_ADCNSM_Pos              2
#define AUDIO_IP_IRQFLAG_OVERCURM_Pos            3

/* Bit field masks: */
#define AUDIO_IP_IRQFLAG_DAOVFM                 ((uint32_t)0x00000001)
#define AUDIO_IP_IRQFLAG_ADCVFM                 ((uint32_t)0x00000002)
#define AUDIO_IP_IRQFLAG_ADCNSM                 ((uint32_t)0x00000004)
#define AUDIO_IP_IRQFLAG_OVERCURM               ((uint32_t)0x00000008)

/** @} */ /* End of group AUDIO_IP_IRQFLAG */

/** @defgroup AUDIO_IP_ADCREG AUDIO_IP ADCREG
  * @{
  */

/*-- AUDIO_IP_ADCREG: AUDIO_IP ADCREG Register -----*/
/* Bit field positions: */
#define AUDIO_IP_ADCREG_ADCSMP_Pos               0

/* Bit field masks: */
#define AUDIO_IP_ADCREG_ADCSMP_Msk               ((uint32_t)0x0000FFFF)

/** @} */ /* End of group AUDIO_IP_ADCREG */

/** @defgroup AUDIO_IP_DACREG AUDIO_IP DACREG
  * @{
  */

/*-- AUDIO_IP_DACREG: AUDIO_IP DACREG Register -----*/
/* Bit field positions: */
#define AUDIO_IP_DACREG_DACSMP_Pos               0

/* Bit field masks: */
#define AUDIO_IP_DACREG_DACSMPMsk                 ((uint32_t)0x0000FFFF)

/** @} */ /* End of group AUDIO_IP_DACREG */

/** @} */ /* End of group __MDR1986VE3_Periph_AUDIO_IP_Defines */

/** @} */ /* End of group __MDR1986VE3_Periph_AUDIO_IP */

/** @defgroup __MDR1986VE3_Periph_KEYPAD KEYPAD
  * @{
  */

/** @defgroup __MDR1986VE3_Periph_KEYPAD_Data_Structures Data Structures
  * @{
  */

/* MDR_KEYPAD_TypeDef structure */
typedef struct
{
    __IO uint32_t KEYPAD_SR;
    __IO uint32_t KEYPAD_CR;
    __IO uint32_t KEYPAD_DR;
    __IO uint32_t KEYPAD_SWR[4];
}MDR_KEYPAD_TypeDef;

/** @} */ /* End of group Periph_KEYPAD_Data_Structures */

/** @defgroup __MDR1986VE3_Periph_KEYPAD_Defines Defines
  * @{
  */

/** @defgroup KEYPAD_CR KEYPAD_CR
  * @{
  */
/*-- KEYPAD_KEYPAD_CR: KEYPAD KEYPAD_CR Register -----*/
/* Bit field positions: */
#define KEYPAD_CR_KEY_EN_Pos                    0
#define KEYPAD_CR_KEY_ROW_Pos                   1
#define KEYPAD_CR_KEY_COL_Pos                   4
#define KEYPAD_CR_KEY_IE_Pos                    8
#define KEYPAD_CR_KEY_ENPCHAT_Pos               9
#define KEYPAD_CR_KEY_PRE_Pos                   10
#define KEYPAD_CR_KEY_LTIM_Pos                  13
#define KEYPAD_CR_KEY_SWMEN_Pos                 16
#define KEYPAD_CR_KEY_SWCOL_Pos                 17
#define KEYPAD_CR_KEY_IVEN_Pos                  21
#define KEYPAD_CR_KEY_IVCONF_Pos                22

/* Bit field masks: */
#define KEYPAD_CR_KEY_EN                        ((uint32_t)0x00000001)
#define KEYPAD_CR_KEY_ROW_Msk                   ((uint32_t)0x0000000E)
#define KEYPAD_CR_KEY_COL_Msk                   ((uint32_t)0x000000F0)
#define KEYPAD_CR_KEY_IE                        ((uint32_t)0x00000100)
#define KEYPAD_CR_KEY_ENPCHAT                   ((uint32_t)0x00000200)
#define KEYPAD_CR_KEY_PRE_Msk                   ((uint32_t)0x00001C00)
#define KEYPAD_CR_KEY_LTIM_Msk                  ((uint32_t)0x0000E000)
#define KEYPAD_CR_KEY_SWMEN                     ((uint32_t)0x00010000)
#define KEYPAD_CR_KEY_SWCOL_Msk                 ((uint32_t)0x001E0000)
#define KEYPAD_CR_KEY_IVEN                      ((uint32_t)0x00200000)
#define KEYPAD_CR_KEY_IVCONF_Msk                ((uint32_t)0x01C00000)

/** @} */ /* End of group KEYPAD_KEYPAD_CR */

