eldarkg/emdr1986x-std-per-lib/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h
/** @defgroup KEYPAD_SR KEYPAD_SR
  * @{
  */

/*-- KEYPAD: KEYPAD_SR Register -----*/
/* Bit field positions: */
#define KEYPAD_SR_KEY_INTF_Pos                  0
#define KEYPAD_SR_KEY_PT1F_Pos                  1
#define KEYPAD_SR_KEY_PT2F_Pos                  2
#define KEYPAD_SR_KEY_ERRF_Pos                  3
#define KEYPAD_SR_KEY_SCF_Pos                   4
#define KEYPAD_SR_KEY_PCHATF_Pos                5

/* Bit field masks: */
#define KEYPAD_SR_KEY_INTF                      ((uint32_t)0x00000001)
#define KEYPAD_SR_KEY_PT1F                      ((uint32_t)0x00000002)
#define KEYPAD_SR_KEY_PT2F                      ((uint32_t)0x00000004)
#define KEYPAD_SR_KEY_ERRF                      ((uint32_t)0x00000008)
#define KEYPAD_SR_KEY_SCF                       ((uint32_t)0x00000010)
#define KEYPAD_SR_KEY_PCHATF                    ((uint32_t)0x00000020)

/** @} */ /* End of group KEYPAD_KEYPAD_SR */

/** @defgroup KEYPAD_DR KEYPAD_DR
  * @{
  */

/*-- KEYPAD_DR: KEYPAD DR Register -----*/
/* Bit field positions: */
#define KEYPAD_DR_KEY_PRESS1_Pos                 0
#define KEYPAD_DR_KEY_PRESS2_Pos                 7

/* Bit field masks: */
#define KEYPAD_DR_KEY_PRESS1_Msk                 ((uint32_t)0x0000007F)
#define KEYPAD_DR_KEY_PRESS2_Msk                 ((uint32_t)0x00003F80)

/** @} */ /* End of group KEYPAD_DR */

/** @} */ /* End of group __MDR1986VE3_Periph_KEYPAD_Defines */

/** @} */ /* End of group __MDR1986VE3_Periph_KEYPAD */

/** @defgroup MDR1986VE3_Periph_LED LED
  * @{
  */

/** @defgroup MDR1986VE3_Periph_LED_Data_Structures Data Structures
  * @{
  */

/* MDR_LED_TypeDef structure */
typedef struct
{
    uint32_t TextBuf[128];
    uint32_t DecodeBuf[320];
    uint32_t CR;
    uint32_t Jark;
    uint32_t RESRVED[2];
    uint32_t DivR;
    uint32_t SR;
}MDR_LED_TypeDef;

/** @} */ /* End of group Periph_LED_Data_Structures */

/** @defgroup MDR1986VE3_Periph_LED_Defines Defines
  * @{
  */

/** @defgroup LED_CR LED CR
  * @{
  */

/*-- LED_CR: LED CR Register -----*/
/* Bit field positions: */
#define LED_CR_DEN_Pos                      0
#define LED_CR_INTEN_Pos                    1
#define LED_CR_TWINK_EN_Pos                 2
#define LED_CR_FRAME_Pos                    3
#define LED_CR_LEN_STR_Pos                  4
#define LED_CR_LEN_STOLB_Pos                8
#define LED_CR_EN_RAM_Pos                   11
#define LED_CR_INV_Y_Pos                    12
#define LED_CR_INV_EN_Pos                   13
#define LED_CR_INV_C_Pos                    14
#define LED_CR_INV_DO_Pos                   15

/* Bit field masks: */
#define LED_CR_DEN                          ((uint32_t)0x00000001)
#define LED_CR_INTEN                        ((uint32_t)0x00000002)
#define LED_CR_TWINK_EN                     ((uint32_t)0x00000004)
#define LED_CR_FRAME                        ((uint32_t)0x00000008)
#define LED_CR_LEN_STR_Msk                  ((uint32_t)0x00000070)
#define LED_CR_LEN_STOLB_Msk                ((uint32_t)0x00000700)
#define LED_CR_EN_RAM                       ((uint32_t)0x00000800)
#define LED_CR_INV_Y                        ((uint32_t)0x00001000)
#define LED_CR_INV_EN                       ((uint32_t)0x00002000)
#define LED_CR_INV_C                        ((uint32_t)0x00004000)
#define LED_CR_INV_DO                       ((uint32_t)0x00008000)

/** @} */ /* End of group LED_CR */

/** @defgroup LED_JARK LED JARK
  * @{
  */

/*-- LED_JARK: LED JARK Register -----*/
/* Bit field positions: */
#define LED_JARK_Pos                    0

/* Bit field masks: */
#define LED_JARK_Msk                        ((uint32_t)0x000000FF)

/** @} */ /* End of group LED_JARK */

/** @defgroup LED_DIVR LED DIVR
  * @{
  */

/*-- LED_DIVR: LED DIVR Register -----*/
/* Bit field positions: */
#define LED_DIVR_DIV_Pos                    0
#define LED_DIVR_DIV_TWiNK_Pos              8

/* Bit field masks: */
#define LED_DIVR_DIV_Msk                    ((uint32_t)0x00000007)
#define LED_DIVR_DIV_TWiNK_Msk              ((uint32_t)0x0000FF00)

/** @} */ /* End of group LED_DIVR */

/** @defgroup LED_SR LED SR
  * @{
  */

/*-- LED_SR: LED SR Register -----*/
/* Bit field positions: */
#define LED_SR_WR_REDY_Pos                       0

/* Bit field masks: */
#define LED_SR_WR_REDY                          ((uint32_t)0x00000001)

/** @} */ /* End of group LED_SR */

/** @} */ /* End of group MDR1986VE3_Periph_LED_Defines */

/** @} */ /* End of group MDR1986VE3_Periph_LED */

/** @defgroup __VE3___Peripheral_Memory_Map Peripheral Memory Map
  * @{
  */

#define MDR_CAN1_BASE             (0x40000000)
#define MDR_CAN2_BASE             (0x40008000)
#define MDR_USB_BASE              (0x40010000)
#define MDR_EEPROM_BASE           (0x40018000)
#define MDR_RST_CLK_BASE          (0x40020000)
#define MDR_DMA_BASE              (0x40028000)
#define MDR_UART1_BASE            (0x40030000)
#define MDR_UART2_BASE            (0x40038000)
#define MDR_SSP1_BASE             (0x40040000)
#define MDR_MIL_STD_15531_BASE    (0x40048000)
#define MDR_MIL_STD_15532_BASE    (0x40050000)
#define MDR_POWER_BASE            (0x40058000)
#define MDR_WWDG_BASE             (0x40060000)
#define MDR_IWDG_BASE             (0x40068000)
#define MDR_TIMER1_BASE           (0x40070000)
#define MDR_TIMER2_BASE           (0x40078000)
#define MDR_TIMER3_BASE           (0x40080000)
#define MDR_ADC_BASE              (0x40088000)
#define MDR_DAC_BASE              (0x40090000)
#define MDR_TIMER4_BASE           (0x40098000)
#define MDR_SSP2_BASE             (0x400A0000)
#define MDR_PORTA_BASE            (0x400A8000)
#define MDR_PORTB_BASE            (0x400B0000)
#define MDR_PORTC_BASE            (0x400B8000)
#define MDR_PORTD_BASE            (0x400C0000)
#define MDR_PORTE_BASE            (0x400C8000)
#define MDR_ARINC429R_BASE        (0x400D0000)
#define MDR_BKP_BASE              (0x400D8000)
#define MDR_ARINC429T_BASE        (0x400E0000)
#define MDR_PORTF_BASE            (0x400E8000)
#define MDR_EBC_BASE              (0x400F0000)
#define MDR_SSP3_BASE             (0x400F8000)
#define MDR_AUDIO_IP_BASE         (0x40100000)
#define MDR_LED_BASE              (0x40108000)
#define MDR_KEYPAD_BASE           (0x40110000)
#define MDR_PORTG_BASE            (0x40118000)
#define MDR_UART3_BASE            (0x40120000)
#define MDR_UART4_BASE            (0x40128000)
#define MDR_SSP4_BASE             (0x40130000)
#define MDR_PORTH_BASE            (0x40138000)
#define MDR_PORTI_BASE            (0x40140000)
#define MDR_ETHERNET1_BASE        (0x30000000)
#define MDR_ETHERNET2_BASE        (0x34000000)

/** @} */ /* End of group __Peripheral_Memory_Map */

/** @defgroup __VE3___Peripheral_declaration Peripheral declaration
  * @{
  */

#define MDR_CAN1                  ((MDR_CAN_TypeDef           *)MDR_CAN1_BASE         )
#define MDR_CAN2                  ((MDR_CAN_TypeDef           *)MDR_CAN2_BASE         )
#define MDR_USB                   ((MDR_USB_TypeDef           *)MDR_USB_BASE          )
#define MDR_EEPROM                ((MDR_EEPROM_TypeDef        *)MDR_EEPROM_BASE       )
#define MDR_RST_CLK               ((MDR_RST_CLK_TypeDef       *)MDR_RST_CLK_BASE      )
#define MDR_DMA                   ((MDR_DMA_TypeDef           *)MDR_DMA_BASE          )
#define MDR_UART1                 ((MDR_UART_TypeDef          *)MDR_UART1_BASE        )
#define MDR_UART2                 ((MDR_UART_TypeDef          *)MDR_UART2_BASE        )
#define MDR_SSP1                  ((MDR_SSP_TypeDef           *)MDR_SSP1_BASE         )
#define MDR_MIL_STD_15531         ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15531_BASE)
#define MDR_MIL_STD_15532         ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15532_BASE)
#define MDR_POWER                 ((MDR_POWER_TypeDef         *)MDR_POWER_BASE        )
#define MDR_WWDG                  ((MDR_WWDG_TypeDef          *)MDR_WWDG_BASE         )
#define MDR_IWDG                  ((MDR_IWDG_TypeDef          *)MDR_IWDG_BASE         )
#define MDR_TIMER1                ((MDR_TIMER_TypeDef         *)MDR_TIMER1_BASE       )
#define MDR_TIMER2                ((MDR_TIMER_TypeDef         *)MDR_TIMER2_BASE       )
#define MDR_TIMER3                ((MDR_TIMER_TypeDef         *)MDR_TIMER3_BASE       )
#define MDR_ADC                   ((MDR_ADC_TypeDef           *)MDR_ADC_BASE          )
#define MDR_DAC                   ((MDR_DAC_TypeDef           *)MDR_DAC_BASE          )
#define MDR_TIMER4                ((MDR_TIMER_TypeDef         *)MDR_TIMER4_BASE       )
#define MDR_SSP2                  ((MDR_SSP_TypeDef           *)MDR_SSP2_BASE         )
#define MDR_PORTA                 ((MDR_PORT_TypeDef          *)MDR_PORTA_BASE        )
#define MDR_PORTB                 ((MDR_PORT_TypeDef          *)MDR_PORTB_BASE        )
#define MDR_PORTC                 ((MDR_PORT_TypeDef          *)MDR_PORTC_BASE        )
#define MDR_PORTD                 ((MDR_PORT_TypeDef          *)MDR_PORTD_BASE        )
#define MDR_PORTE                 ((MDR_PORT_TypeDef          *)MDR_PORTE_BASE        )
#define MDR_ARINC429R             ((MDR_ARINC429R_TypeDef     *)MDR_ARINC429R_BASE    )
#define MDR_BKP                   ((MDR_BKP_TypeDef           *)MDR_BKP_BASE          )
#define MDR_ARINC429T             ((MDR_ARINC429T_TypeDef     *)MDR_ARINC429T_BASE    )
#define MDR_PORTF                 ((MDR_PORT_TypeDef          *)MDR_PORTF_BASE        )
#define MDR_EBC                   ((MDR_EBC_TypeDef           *)MDR_EBC_BASE          )
#define MDR_SSP3                  ((MDR_SSP_TypeDef           *)MDR_SSP3_BASE         )
#define MDR_AUDIO_IP              ((MDR_AUDIO_IP_TypeDef      *)MDR_AUDIO_IP_BASE     )
#define MDR_KEYPAD                ((MDR_KEYPAD_TypeDef        *)MDR_KEYPAD_BASE       )
#define MDR_LED                   ((MDR_LED_TypeDef           *)MDR_LED_BASE          )
#define MDR_PORTG                 ((MDR_PORT_TypeDef          *)MDR_PORTG_BASE        )
#define MDR_UART3                 ((MDR_UART_TypeDef          *)MDR_UART3_BASE        )
#define MDR_UART4                 ((MDR_UART_TypeDef          *)MDR_UART4_BASE        )
#define MDR_SSP4                  ((MDR_SSP_TypeDef           *)MDR_SSP4_BASE         )
#define MDR_PORTH                 ((MDR_PORT_TypeDef          *)MDR_PORTH_BASE        )
#define MDR_PORTI                 ((MDR_PORT_TypeDef          *)MDR_PORTI_BASE        )
#define MDR_ETHERNET1             ((MDR_ETHERNET_TypeDef      *)MDR_ETHERNET1_BASE    )
#define MDR_ETHERNET2             ((MDR_ETHERNET_TypeDef      *)MDR_ETHERNET2_BASE    )

/** @} */ /* End of group __Peripheral_declaration */

/** @} */ /* End of group __MDR1986VE3_Peripheral */

#define CLR_BIT(a,b) ((a) &= ~(1U << (b)))
#define SET_BIT(a,b) ((a) |= (1U << (b)))
#define INV_BIT(a,b) ((a) ^= (1U << (b)))

#define CHF_BIT(a,b) (((a) & (1U << (b))) == 0)
#define CHT_BIT(a,b) (((a) & (1U << (b))) != 0)

/** @} */ /* End of group MDR1986VE3 */

/** @} */ /* End of group __CMSIS */

#ifdef __cplusplus
}
#endif

#endif /* __MDR1986VE3_H */

/******************* (C) COPYRIGHT 2013 Milandr ********************************
*
* END OF FILE MDR1986VE3.h */
